// << React Component 만드는 법 >>
/* 
김규리 매니저:탠저린:  오후 5:45
@channel
리액트 수업 참여링크입니다.
https://zoom.us/j/93839493972

박명재  오후 5:59
잘 들려용~

정지훈  오후 5:59
네

백나라  오후 5:59
네

박명재  오후 6:00
넵

김용민  오후 6:00
네

박명재  오후 6:01
넵
6:01
넵
6:01
ㅇㅇ

김용민  오후 6:01
ㅇㅇ

이웅재 강사  오후 6:01
ㅇ

정지훈  오후 6:01
ㅇ

박명재  오후 6:01
ㅇ

박상언  오후 6:01
ㅇ

이영상  오후 6:01
ㅋㅋㅋㅋ

김용민  오후 6:02
ㅇ

임영서  오후 6:02
ㅇ

석금용  오후 6:02
ㅇ

이영상  오후 6:02
ㅇ

김동찬  오후 6:02
ㅇ

김용민  오후 6:02
네

김동찬  오후 6:02
네

정지훈  오후 6:02
네

임영서  오후 6:02
네

박명재  오후 6:03
넵

김용민  오후 6:05
네

이영상  오후 6:05
네

조윤아  오후 6:05
네

박명재  오후 6:05
넵

석금용  오후 6:05
넹
6:06
넵
6:06
넵
6:07
넵

김동찬  오후 6:07
네

석금용  오후 6:07
넵
6:08
컴퍼넌트

김동찬  오후 6:08
네

정지훈  오후 6:08
네

석금용  오후 6:08
넵

김용민  오후 6:08
네

석금용  오후 6:09
넵
6:09
넵

박명재  오후 6:09
넵

백나라  오후 6:09
넵

석금용  오후 6:09
ㅇ

박명재  오후 6:09
ㅐ
6:09
o

김용민  오후 6:09
ㅋㅋㅋ
:하트2:
1


석금용  오후 6:09
ㅋㅋㅋㅋㅋ

정지훈  오후 6:09
ㅇ

김용민  오후 6:10
두개가 나옵니다
:번쩍:
1


백나라  오후 6:10
profile만

석금용  오후 6:10
프로필만

조재연  오후 6:10
프로필만

김재민  오후 6:10
ㅋㅋㅋ

임영서  오후 6:10
요렇게 뜹니당
스크린샷 2020-12-15 오후 6.09.26.png 
스크린샷 2020-12-15 오후 6.09.26.png



김용민  오후 6:10
오타입니다..

김재민  오후 6:10
import 안한거같은데

석금용  오후 6:10
import { BrowserRouter, Route } from 'react-router-dom';
:hyperfastparrot:
1


백나라  오후 6:10
import 안한거아님?

조재연  오후 6:11
ㅋㅋㅋㅋ

김재민  오후 6:11
ㅋㅋㅋㅋㅋ

석금용  오후 6:11
ㅋㅋㅋㅋㅋㅋㅋ

조윤아  오후 6:11
ㅋㅋㅋㅋㅋ

김용민  오후 6:11
여론이 안좋다 영서야

김동찬  오후 6:11
왜 안했어

이영상  오후 6:11
ㅋㅋㅋㅋ

이한슬  오후 6:11
ㅋㅋㅋㅋㅋㅋ

임영서  오후 6:11
ㅠㅠ

김동찬  오후 6:11
에휴!!!

석금용  오후 6:11
집중집중

박명재  오후 6:11
ㅋㅋㅋ

임영서  오후 6:11
route 빼먹음
6:11
ㅠ

김재민  오후 6:11
잘하자
:hyperfastparrot:
1
:coffin_dance:
1


김어진  오후 6:11
영서야 괜찮아
6:11
모르니깐 학원다니지
:두_눈:
4


김용민  오후 6:11
네

김동찬  오후 6:11
ㅋㅋ

석금용  오후 6:11
넵

김동찬  오후 6:11
네

석금용  오후 6:12
넵
6:12
넵

김재민  오후 6:12
네

석금용  오후 6:13
넵

김재민  오후 6:14
아하

석금용  오후 6:14
넵
6:14
두개가

김용민  오후 6:14
ㄴㅔ

석금용  오후 6:15
넵

조윤아  오후 6:15
네

백나라  오후 6:15
네

석금용  오후 6:15
넵
6:17
넵
6:19
넵
6:19
누가

박명재  오후 6:19
컴포넌트?

김용민  오후 6:19
네

김동찬  오후 6:20
네
6:21
네

김용민  오후 6:21
네

석금용  오후 6:21
넵
6:22
props를 보내준 짓

김용민  오후 6:22
네
6:22
라우트컴포넌트?

박명재  오후 6:22
react-rout

석금용  오후 6:22
router?

박명재  오후 6:22
er

김재민  오후 6:23
라우트

석금용  오후 6:23
spq

김용민  오후 6:23
네

김동찬  오후 6:24
네

김재민  오후 6:24
네

석금용  오후 6:24
넵

김동찬  오후 6:24
네

김용민  오후 6:24
네

석금용  오후 6:24
넵

김재민  오후 6:24
네

김동찬  오후 6:25
3

석금용  오후 6:25
3
6:25
넵
6:25
undefined

김동찬  오후 6:25
undefined

석금용  오후 6:25
넵

김동찬  오후 6:25
네

김재민  오후 6:25
네

석금용  오후 6:25
넵

김용민  오후 6:25
네

김재민  오후 6:26
{}

김용민  오후 6:26
중괄호

이영상  오후 6:26
중괄호

김동찬  오후 6:26
네

김용민  오후 6:26
네

박명재  오후 6:26
넵

석금용  오후 6:27
넵

이영상  오후 6:27
숫자

김동찬  오후 6:27
숫자

석금용  오후 6:27
넵

김용민  오후 6:27
네

박명재  오후 6:27
넵

석금용  오후 6:27
string

정지훈  오후 6:27
스트링

박명재  오후 6:27
문자열

김재민  오후 6:27
문자열

이영상  오후 6:27
string

김동찬  오후 6:27
네

석금용  오후 6:27
넵

김용민  오후 6:27
네

석금용  오후 6:27
넵

박명재  오후 6:28
넵

김재민  오후 6:28
네

백나라  오후 6:28
넵

이영상  오후 6:28
네

김동찬  오후 6:28
O

김용민  오후 6:28
네

조재연  오후 6:28
spd

이한슬  오후 6:28
네

조윤아  오후 6:28
넴

석금용  오후 6:28
user_id

김용민  오후 6:29
네
6:29
ㅠ

김재민  오후 6:29
ㅋㅋㅋ

조윤아  오후 6:29
ㅠㅠㅠ

석금용  오후 6:30
쿼리

김용민  오후 6:30
쿼리

김재민  오후 6:30
쿼리요

정지훈  오후 6:30
쿼리

김동찬  오후 6:30
쿼리

석금용  오후 6:30
패스

박명재  오후 6:30
path

정지훈  오후 6:30
파람스
:두_눈:
2
:yuna-cho:
3
:coffin_dance:
2
:100:
3
:aaw_yeah:
1
:hyperfastparrot:
2


조윤아  오후 6:30
path??

석금용  오후 6:30
오

조윤아  오후 6:30
오...

김동찬  오후 6:31
네

석금용  오후 6:31
넵

김동찬  오후 6:32
넵
6:33
네

조재연  오후 6:34
ㅜㅜ

김용민  오후 6:34
ㅠ
6:34
ㅋㅋㅋ

박명재  오후 6:34
ㅋㅋㅋㅋ

김재민  오후 6:34
힘내세요
:근육:
2
:울다:
4
:+1:
2


김동찬  오후 6:34
:기도:

석금용  오후 6:35
문자열 자르기

조재연  오후 6:35
슬라ㅣ이싱

백나라  오후 6:35
슬라이스

김어진  오후 6:36
string.slice(0,3) (편집됨) 

박명재  오후 6:36
-1
:두_눈:
1


김용민  오후 6:36
serach.substring(4)
:두_눈:
1


박명재  오후 6:36
흠

김재민  오후 6:37
오

백나라  오후 6:37
oh

조재연  오후 6:37
5

김용민  오후 6:37
앗

석금용  오후 6:37
정규 표현식 쓰고
6:38
넵

김재민  오후 6:38
네

김동찬  오후 6:38
넴

김용민  오후 6:39
네

조재연  오후 6:39
아뇨

김재민  오후 6:39
처음봐요

박상언  오후 6:39
처음봅니다

조재연  오후 6:40
네

김용민  오후 6:40
네

김동찬  오후 6:40
네

백나라  오후 6:40
sp

석금용  오후 6:41
ie
:손으로_얼굴을_가린_여성:
3


정지훈  오후 6:41
ie

조윤아  오후 6:41
IE

김용민  오후 6:41
네

석금용  오후 6:41
넵

백나라  오후 6:41
ㄴㅔ

석금용  오후 6:42
오
:두_눈:
4

6:43
넵

김동찬  오후 6:43
넵

김용민  오후 6:43
zzz

조윤아  오후 6:43
넴

석금용  오후 6:43
ㅋㅋㅋㅋㅋㅋ

김용민  오후 6:43
ㅋㅋㅋ

백나라  오후 6:43
z

김재민  오후 6:44
ㅋㅋㅋㅋ

이영상  오후 6:44
ㅋㅋㅋㅋ

김어진  오후 6:44
ㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋ

백나라  오후 6:44
ㅋㅋㅋㅋ

석금용  오후 6:44
넵

조재연  오후 6:44
ㅋㅋㅋㅋ

이한슬  오후 6:44
네ㅋㅋ

김용민  오후 6:44
중국산이 아니라서?
:두_눈:
1
:기쁨:
1


박명재  오후 6:44
검증된건가 ?

김동찬  오후 6:44
많이 다운했으니까 검증이 되었다
6:45
오우

조재연  오후 6:45
ㅋㅋㅋㅋ

김동찬  오후 6:45
신드레씨

김재민  오후 6:45
ㅋㅋㅋㅋ

김동찬  오후 6:45
네

조윤아  오후 6:45
ㅋㅋㅋㅋ

김용민  오후 6:45
네
6:45
ㅋㅋㅋ

조재연  오후 6:45
요

백나라  오후 6:45
ㅇㅛ

조윤아  오후 6:45
ㅋㅋㅋㅋㅋㅋㅋㅋ

김어진  오후 6:45
많이 쓰이면 돈주나요
:두_눈:
2
:질문:
3
:slide-bottom-1:
2


김동찬  오후 6:45
이요
:excuseme:
3
:catjam:
2

6:46
ㅋㅋㅋ

석금용  오후 6:46
ㅋㅋㅋㅋㅋㅋㅋ

조윤아  오후 6:46
ㅋㅋㅋㅋㅋㅋ

김동찬  오후 6:46
조르단

김어진  오후 6:46
브랜든 아이크씨

김재민  오후 6:46
조르단

김용민  오후 6:46
조단 왈케

조재연  오후 6:46
ㅋㅋㅋ

조윤아  오후 6:46
ㅋㅋㅋㅋㅋ

김동찬  오후 6:46
라이언 달

이영상  오후 6:46
ㅋㅋㅋ

박명재  오후 6:46
문어

김용민  오후 6:47
문어아저씨
:문어:
1
:everythings_fine_parrot:
1


백나라  오후 6:47
c 들어가는.

정지훈  오후 6:47
노마드코더
:+1:
1
:완전히_반한:
1
:두_눈:
1
:among-us-party:
2


김재민  오후 6:47
니꼴라스
:두_눈:
4


김용민  오후 6:47
ㅋㅋ

김동찬  오후 6:47
ㅋㅋㅋㅋㅋㅋㅋ

조윤아  오후 6:47
ㅋㅋㅋㅋㅋ

김어진  오후 6:48
돈많이벌어요

박상언  오후 6:48
돈벌어요?

김동찬  오후 6:48
돈 법니다

조재연  오후 6:48
약팔아요
:두_눈:
1


김용민  오후 6:48
구글갑니다

박상언  오후 6:48
돈벌려고

김동찬  오후 6:48
돈 벌려고요

석금용  오후 6:48
사업

김용민  오후 6:48
좋은회사가서 개발합니다

석금용  오후 6:48
오

조재연  오후 6:48
오호

김재민  오후 6:49
몰라요

조윤아  오후 6:49
그사세....
:두_눈:
2
:yuna-cho:
1


김동찬  오후 6:49
강사님도 잘하시잖아요~~

석금용  오후 6:49
ㅋㅋㅋㅋ

김어진  오후 6:49
말도안되

조재연  오후 6:49
강사님2.9

김재민  오후 6:49
2.99
:두_눈:
2
:정원이_있는_집:
2


조윤아  오후 6:49
ㅋㅋㅋㅋㅋ

김용민  오후 6:49
ㅋㅋㅋ

이한슬  오후 6:49
ㅋㅋㅋㅋㅋㅋㅋㅋ

김어진  오후 6:49
ㅋㅋ

석금용  오후 6:49
오

조재연  오후 6:49
맞습니다

석금용  오후 6:49
넵

김어진  오후 6:52
강사님 병원가보셨나요?
기침 오래하셔서 걱정되네요:실망스럽지만_안도한:
:기도:
3
:두꺼운_더하기_기호:
1


이웅재 강사  오후 6:53
수업하고 더 심해졌어요~ ㅜ
:울다:
1
:울음:
1


김동찬  오후 6:53
목을 많이 쓰셔서 그런가봐요

이웅재 강사  오후 6:53
확실한건 코로나는 아니에요 ㅋㅋ
6:54
병원가면 코로나라고 선별진료소 가라하고
6:54
복잡하드라구요
6:54
근데 우리 원래 20명이에요??

김규리 매니저:탠저린:  오후 6:54
강사님도, 여러분도 모두 건강조심하세요~
:하트2:
2

6:55
수강생은 총 18명입니다
6:55
이 채널안에는 저랑, 경수 매니저님, 강사님까지 포함해서 21명이 있습니다

이웅재 강사  오후 6:55
아하아하 네네 모두 건강 조심하세요
이 일이 몸쓰는 일이 아닌데 속으로 골아요~

김규리 매니저:탠저린:  오후 6:55
동의합니다…..

이웅재 강사  오후 6:55
제또래 개발자들 다 골골댑니다 ㅋㅋㅋㅋㅋ (편집됨) 
:비명:
1


김어진  오후 6:56
ㅜㅜ

김용민  오후 6:56
비타민씨 많이드세요
:약:
2

6:56
비타민디랑

김규리 매니저:탠저린:  오후 6:56
영양제 컨설팅…

김어진  오후 6:56
아연도

김동찬  오후 6:56
전문가예요 용민이가

이웅재 강사  오후 6:56
ㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎ

백나라  오후 7:01
넵

김용민  오후 7:01
s네

석금용  오후 7:01
넵

김동찬  오후 7:01
네

조윤아  오후 7:01
넹

석금용  오후 7:01
듣고 있습니답
7:02
넵
7:02
넵

김용민  오후 7:02
네

김동찬  오후 7:02
네

김재민  오후 7:02
네

박명재  오후 7:03
넵

석금용  오후 7:04
넵

김동찬  오후 7:04
네
7:04
아하

석금용  오후 7:05
넵

김용민  오후 7:05
네

석금용  오후 7:07
넵

백나라  오후 7:07
네

김용민  오후 7:07
네
7:07
네

석금용  오후 7:07
넵
7:07
넵

백나라  오후 7:07
네

석금용  오후 7:08
spq
7:08
넵
7:09
넵

김재민  오후 7:09
sp

박명재  오후 7:09
오

김용민  오후 7:11
네

백나라  오후 7:11
sp

조재연  오후 7:11
네

김재민  오후 7:11
오

박명재  오후 7:11
넵

석금용  오후 7:12
넵

조재연  오후 7:12
순서는 임의로 설정하나요??

김동찬  오후 7:12
ㄴ ㅔ

이한슬  오후 7:12
강사님 about이랑 profile 순서도 그렇게 정해진건가요?

김재민  오후 7:12
지금 profile을 비교하는거라 about이 위에 있는건가요?

박명재  오후 7:12
akwdk

김동찬  오후 7:12
ㅋㅋㅋㅋㅋ

김재민  오후 7:13
네

석금용  오후 7:13
넵
7:13
profile
7:13
ㅑㅇ

김재민  오후 7:13
아하

석금용  오후 7:13
id

김동찬  오후 7:13
id

석금용  오후 7:13
넵

김재민  오후 7:13
네

정지훈  오후 7:13
아하

석금용  오후 7:13
넵

김재민  오후 7:14
아하

이한슬  오후 7:14
네

석금용  오후 7:14
id

김재민  오후 7:14
아이디요

김동찬  오후 7:14
id

정지훈  오후 7:14
id

이영상  오후 7:14
id

석금용  오후 7:14
넵

김재민  오후 7:14
네

석금용  오후 7:15
넵
7:15
넵

김재민  오후 7:15
네네

박명재  오후 7:15
넵

이한슬  오후 7:15
1번

석금용  오후 7:15
위
7:15
넵

김용민  오후 7:16
네

석금용  오후 7:16
넵

김재민  오후 7:16
넵

이한슬  오후 7:16
네

백나라  오후 7:16
넵

이영상  오후 7:16
넵

석금용  오후 7:16
넵

조재연  오후 7:16
네

석금용  오후 7:20
강사님
:fb-like:
5
:하트2:
2
:+1:
1

7:21
실례가 안된다면 지금 ErrorBoundary를 감싼 이유 다시 설명해주실 수 있을까요.. 어제 내용 까먹어서용...
7:22
NotFound 컴포넌트는 라우터 에러를 보여주는거고 ErrorPage는 기능 에러가 발생했을 때 보여주는 거에요???
7:22
spqspq
7:22
넵넵
7:23
넵 감사합니다!

김동찬  오후 7:24
다시 보여주세욥

석금용  오후 7:24
넵

김동찬  오후 7:24
로딩

조재연  오후 7:24
네

김용민  오후 7:24
네

석금용  오후 7:24
로딩
7:26
넵

조재연  오후 7:26
네

석금용  오후 7:26
넵

백나라  오후 7:26
넵

김동찬  오후 7:26
a

백나라  오후 7:26
a

석금용  오후 7:26
a

김용민  오후 7:26
네

석금용  오후 7:28
로딩
7:28
깜빡

김동찬  오후 7:28
쨘
:among_us_orange_dance:
3


김용민  오후 7:28
sp

김동찬  오후 7:28
네

석금용  오후 7:28
넵

김용민  오후 7:28
네

백나라  오후 7:28
네

조재연  오후 7:29
네

박명재  오후 7:29
네

석금용  오후 7:29
맥락상

박명재  오후 7:29
2?

조재연  오후 7:29
안이상합니다

정지훈  오후 7:29
1?

석금용  오후 7:29
1

정지훈  오후 7:30
서버가 아니라 클라이언트
7:30
?

석금용  오후 7:30
root 요소에 들어가는게 바뀌는거라 생각했어요

김재민  오후 7:31
서버에 요청하는게 아닌거같아요
:clapping:
2
:+1:
1
:전구:
1


김동찬  오후 7:31
서버

김용민  오후 7:31
아하

조재연  오후 7:31
넵

조윤아  오후 7:31
네

김용민  오후 7:31
네

김재민  오후 7:31
아항

조재연  오후 7:31
네

석금용  오후 7:32
오

김재민  오후 7:32
버튼?

조재연  오후 7:32
오호
7:33
네

석금용  오후 7:33
오

김용민  오후 7:33
오

이한슬  오후 7:33
오

김재민  오후 7:33
오

김용민  오후 7:33
로딩이 안되여ㅛ

백나라  오후 7:33
로딩이 안돼여

이영상  오후 7:33
오..

김재민  오후 7:33
신기해요
:+1:
3
:mario:
1
:yuna-cho:
2


김동찬  오후 7:33
와우
:excuseme:
3


조윤아  오후 7:34
우와

석금용  오후 7:34
네ㅐ베

김동찬  오후 7:34
네

김용민  오후 7:35
네

백나라  오후 7:35
네

이한슬  오후 7:35
네

조윤아  오후 7:35
ㅋㅋㅋㅋ

김재민  오후 7:35
ㅎㅎ

이한슬  오후 7:35
ㅋㅋㅋㅋㅋㅋㅋ

조재연  오후 7:35
ㅋㅋㅋㅋㅋㅋ

조윤아  오후 7:35
ㅠㅠ

석금용  오후 7:35
넵

조재연  오후 7:35
네

석금용  오후 7:35
넵

김동찬  오후 7:36
네엡

조재연  오후 7:36
넹
7:36
a태그

백나라  오후 7:36
a

김재민  오후 7:36
네

김동찬  오후 7:36
ㅋㅋㅋㅋㅋㅋ

김용민  오후 7:36
네

김어진  오후 7:36
ㅋㅋㅋㅋㅋㅋ

석금용  오후 7:36
넵

김어진  오후 7:36
아하
:computerrage:
1


김재민  오후 7:36
네

김용민  오후 7:36
네

석금용  오후 7:36
넵

김재민  오후 7:36
네

이한슬  오후 7:37
네

김어진  오후 7:37
재미있어요

김용민  오후 7:37
네~

박상언  오후 7:37
넵

조윤아  오후 7:37
넵

석금용  오후 7:37
넵

김동찬  오후 7:37
sp
7:37
네

김용민  오후 7:37
네

김재민  오후 7:37
네

김동찬  오후 7:37
넵

석금용  오후 7:37
넵
7:38
넵

김용민  오후 7:38
네

김어진  오후 7:39
ㅋㅋ

김재민  오후 7:39
네

석금용  오후 7:39
넵

이한슬  오후 7:39
네

조재연  오후 7:39
네

석금용  오후 7:40
아

김동찬  오후 7:40
WOw

김재민  오후 7:40
오

석금용  오후 7:40
넵

조재연  오후 7:40
네

백나라  오후 7:40
네

김재민  오후 7:40
네

석금용  오후 7:40
넵

김용민  오후 7:41
exact

석금용  오후 7:41
switch
7:41
아

김용민  오후 7:41
네

석금용  오후 7:41
넵

김용민  오후 7:41
네

석금용  오후 7:42
넵

김동찬  오후 7:42
넴

박명재  오후 7:43
.?

김재민  오후 7:44
color가 문자열?
:광대_얼굴:
1


김동찬  오후 7:44
따옴표
:두_손을_들고_있는_사람:
2


조윤아  오후 7:44
css 따옴표...

김동찬  오후 7:44
붙여야하나요?

조재연  오후 7:44
ㅋㅋㅋㅋ

김용민  오후 7:44
네
7:44
ㅋㅋㅋ

김동찬  오후 7:44
ㅋㅋㅋㅋㅋ

김용민  오후 7:45
네

석금용  오후 7:45
넵

김재민  오후 7:45
ㅋㅋㅋ

김용민  오후 7:45
그러면 라우팅의 / 가 항상 active 클래스 붙어잇는건가요?
7:45
아까 home은 기본으로 초록색 같이 붙어있던거에서
7:45
아 네
7:45
감사합니당
:+1:
1
:하트2:
1
:ahhhhhhhhh:
1


김동찬  오후 7:46
네

김용민  오후 7:46
헉

김재민  오후 7:46
우와

조윤아  오후 7:46
ㅋㅋㅋㅋ

김동찬  오후 7:46
:alert:
:바닥을_구르면서_웃기:
3
:alert:
2
:ahhhhhhhhh:
1


석금용  오후 7:46
아

김동찬  오후 7:46
비상..
7:46
ㄴ ㅔ

석금용  오후 7:46
넵

김재민  오후 7:47
ㅋㅋㅋ

석금용  오후 7:47
넵
7:48
넵

김동찬  오후 7:49
네

김동찬  오후 8:00
네

박명재  오후 8:00
넵

김용민  오후 8:03
네

석금용  오후 8:03
넵

김재민  오후 8:03
ㄴㅔ
:두_눈:
1


박명재  오후 8:03
o
:두_눈:
2


김동찬  오후 8:03
ㅇ
:두_손을_들고_있는_사람:
1


석금용  오후 8:03
ㅇ

김용민  오후 8:03
ㅇ

김재민  오후 8:03
8
:전구:
1
:두_눈:
1
:bob_ross_parrot:
1
:기쁨:
1


김용민  오후 8:04
ㅋㅋ

이한슬  오후 8:04
ㅋㅋㅋㅋㅋㅋㅋ

김동찬  오후 8:04
ㅋㅋㅋㅋ

김용민  오후 8:04
a태그

박명재  오후 8:04
form

석금용  오후 8:04
location

김동찬  오후 8:04
loaction

김용민  오후 8:04
loction
8:04
assign

정지훈  오후 8:04
location

김용민  오후 8:05
ㅋㅋ

석금용  오후 8:05
로딩

김재민  오후 8:05
돌았어요

김동찬  오후 8:05
네

석금용  오후 8:05
넵
8:05
넵

김재민  오후 8:06
네

김동찬  오후 8:06
네

석금용  오후 8:06
넵
8:07
주소창

김용민  오후 8:07
네

김동찬  오후 8:07
넵!

석금용  오후 8:08
넵

김동찬  오후 8:08
네
8:08
오호

석금용  오후 8:08
오

정지훈  오후 8:09
와

김동찬  오후 8:09
맞스니다

이한슬  오후 8:09
강사님 질문있는데
8:09
저렇게 로딩이 되지 않고 페이지를 이동하는게 리액트를 사용해서 가능한 건가요?
8:09
자바스크립트만으로는 <a>나 window.location같이 로딩이 필연적으로 발생할 수 밖에 없나요?
:박수:
4
:+1:
3
:하트2:
1
:fb-like:
1

8:09
오 감사합니다!
:눈이_하트_모양인_얼굴:
4
:hyperfastparrot:
3
:다트:
2


김재민  오후 8:13
props를 안줘서?

김용민  오후 8:13
네

석금용  오후 8:13
넵

김동찬  오후 8:13
넵

석금용  오후 8:13
Login

김용민  오후 8:13
네

석금용  오후 8:13
넵
8:14
오?

김용민  오후 8:14
네

김동찬  오후 8:14
네!

정지훈  오후 8:14
네

김용민  오후 8:14
:박수::피부톤_5:

김동찬  오후 8:15
props를 계속 전달해야합니다

박명재  오후 8:15
계속 proprs 전달

김동찬  오후 8:15
네

김용민  오후 8:15
네

김재민  오후 8:15
네

김용민  오후 8:15
전달만

김재민  오후 8:15
props를 전달해요

김동찬  오후 8:15
넵

김재민  오후 8:15
네

김용민  오후 8:15
맞습니다

박명재  오후 8:15
넵

김용민  오후 8:16
네
:두_눈:
1

8:16
고차 컴포
:두_눈:
1

8:16
넌트
:두_눈:
1


석금용  오후 8:17
넵

김동찬  오후 8:17
네

석금용  오후 8:17
redux

김재민  오후 8:17
아하

김동찬  오후 8:17
hooks?
:yuna-cho:
2
:+1:
1


석금용  오후 8:17
아아아

김용민  오후 8:18
네

석금용  오후 8:18
넵

김동찬  오후 8:18
네

김용민  오후 8:19
네

김동찬  오후 8:19
알겟습니다

석금용  오후 8:19
넵

김동찬  오후 8:19
감사합니다

김용민  오후 8:19
ㅋㅋ

김재민  오후 8:19
감사합니당

김어진  오후 8:19
ㅋㅋㅋㅋ

김동찬  오후 8:20
변수

김용민  오후 8:20
네

석금용  오후 8:21
넵

김재민  오후 8:21
오

김용민  오후 8:21
네

석금용  오후 8:21
넵

김용민  오후 8:23
네

김재민  오후 8:23
네

김용민  오후 8:25
네

석금용  오후 8:25
넵
8:27
넵

김용민  오후 8:27
네

석금용  오후 8:28
넵
8:28
넵
8:29
넵
8:29
대문자

김동찬  오후 8:30
네

석금용  오후 8:31
넵

김동찬  오후 8:31
넵

김용민  오후 8:31
네

석금용  오후 8:31
넵
8:32
넵
8:32
넵

김재민  오후 8:32
네

김동찬  오후 8:33
넵

석금용  오후 8:34
정복 중

김용민  오후 8:34
직전입니다

김동찬  오후 8:34
복습을 통한 정복

박명재  오후 8:34
정복 당했다
:o_표시를_한_여성:
4
:piggy:
1


석금용  오후 8:34
저 질문있습니다

김용민  오후 8:34
ㅋㅋㅋ

석금용  오후 8:34
아까
8:34
<Button {...props} /> 이렇게 props를 넘겼는데
8:35
props를 넘기는 하나의 방법으로 외우면 될까용...??

김동찬  오후 8:35
ㄴ ㅔ

김용민  오후 8:36
그러면 넘겨준 props원본이 바뀌면
8:36
전달받은 애도 바뀌나요?
8:36
얕은복사해온거니까?
8:36
네 알겠습니다

김동찬  오후 8:36
그럼 일반적으로 저렇게 쓰는 이유가
8:36
props를 전달한다는게 연관 있는 컴포넌트끼리
8:37
라서 인가요
8:37
네

석금용  오후 8:37
<Button props={props} /> 이거랑 다른건가요?
8:38
아 맞아요 맞아요
:하트2:
1
:among_us_orange_dance:
1

8:38
아 대박
8:38
넵

김용민  오후 8:38
강사님 질문 하나 더있습니다. props가 바뀌면 렌더가 다시 되는걸로 요청되는데, 그러면 부모에서 props가 바뀌어서 렌더가 되면 부모가다시 렌더되고, 그때 자식도  재렌더 되는건가요 아니면 차례대로 되는건가요
:하트2:
1
:mcdonalds:
1


김재민  오후 8:38
ㅋㅋㅋ

김용민  오후 8:39
네네
8:39
네 알겠습니다 감사합니다
:aaw_yeah:
1
:alert:
1


김동찬  오후 8:40
해커톤 안한대요 ~

김어진  오후 8:40
해커톤 없다고 들었습니다
8:40
미니프로젝트만
8:40
네

김동찬  오후 8:40
네

김규리 매니저:탠저린:  오후 8:40
https://docs.google.com/spreadsheets/d/1864KYOYBeraGTq5cWPRbWFKs2Z99oXB68ev08w67w8Y/edit#gid=865942619

김어진  오후 8:40
한달짜리

김규리 매니저:탠저린:  오후 8:40
저희 강의일정표입니다

김동찬  오후 8:41
네 알겠읍니다

이한슬  오후 8:41
네

김어진  오후 8:42
강사님  취업할때 포트폴리오가 중요할까요

김규리 매니저:탠저린:  오후 8:42
1월 11일 ~ 1월 15일 :  미니프로젝트 & 수업
1월 18일 ~ : 최종프로젝트
일단 일정나온겁니다.

김동찬  오후 8:43
넵

이한슬  오후 8:43
:울다:

김재민  오후 8:43
외주 작업도 도움이 될까요?

박명재  오후 8:44
사이드 프로젝트는 어떻게 해요?

김어진  오후 8:44
그렇다면 프로젝트 포트폴리오로 한달이상을 투자해야하나요

김동찬  오후 8:45
강사님 재택근무 하세요~?
:두_눈:
1

8:45
식사하시고 수업하세요~?

백나라  오후 8:45
우와..

임영서  오후 8:45
우왕

석금용  오후 8:45
ㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋ

김동찬  오후 8:46
이런..
:두_눈:
2


김재민  오후 8:46
팀장님 되면 뭐가 제일 힘드세요

김어진  오후 8:46
회사에서 스터디도 하시나요
8:46
ㅌ팀장님이 주도하신요
8:47
신입이 들어왔을때 제일 답답할때는 어떨때인가요
:ahhhhhhhhh:
1
:hyperfastparrot:
2
:+1:
2


김동찬  오후 8:47
ㅋㅋㅋㅋㅋ

이한슬  오후 8:48
강사님께서는 신입에게 가장 바라는 점이 있다면 어떤 게 있으신가요?
:질문:
1
:회색_물음표:
1
:감탄_의문_부호:
2


김어진  오후 8:48
얼마나 고민하고 물어봐야할까요

김동찬  오후 8:48
ㅋㅋㅋㅋㅋㅋㅋ
8:48
급 질문타임

석금용  오후 8:48
강사님께서 가르친 학생들은 연봉 얼마 받고 들어가길 바라시나용?

김어진  오후 8:49
신입이 어느정도 기술스펙을 가져야할까요?
8:50
아닙니다 감사합니다
:고양이:
2
:햄스터:
1
:나쁜_것을_보지_말라:
2
:푸들:
2


박상언  오후 8:52
감사합니다!
:눈이_하트_모양인_얼굴:
4
:하트2:
1


석금용  오후 8:52
감사합니당
:박수:
3
:하트2:
1


이한슬  오후 8:52
감사합니다:눈이_하트_모양인_얼굴:
:하트2:
5


김어진  오후 8:52
멋
:among_us_orange_dance:
1
:javascript:
2
:slack:
1


김규리 매니저:탠저린:  오후 8:53
수고하셨습니다

김동찬  오후 8:53
화면 분할하니까 너무 좋은것같습니다
:하트2:
1


김어진  오후 8:53
감사합니다

김용민  오후 8:53
수고하셧습니다

김동찬  오후 8:53
수고하셨씁니다~~

강주현  오후 8:53
수고하셨습니다~

백나라  오후 8:53
넵!!! 감사합니다!!

박명재  오후 8:53
고생하셨습니다~

조윤아  오후 8:53
감사합니다~!!!

정지훈  오후 8:53
수고하셨습니다

김용민  오후 8:53
:bob_ross_parrot:



4개의 답글
5일 전 마지막 답글스레드 보기

김재민  오후 8:53
수고 많으셨습니다~~~

이영상  오후 8:53
고생하셨습니다~

김어진  오후 8:53
:하트2:

김동찬  오후 8:53
맛저~
:새우튀김:
2
:hulahula:
2
:dance-fast:
3
:party:
2
:spin-fast:
2
:angyoona:
2


이웅재 강사  오후 5:19
https://slides.com/woongjae/fds17th-5
SlidesSlides
5. React Component Styling
Fast Campus Frontend Developer School 17th (25kB)
https://media.slid.es/thumbnails/2deb51d8ba7bc6c728c0ae3bbbdd1c9c/thumb.jpg?1608103574

박명재  오후 5:20
강사님 수업전에 github 업데이트 부탁드려요 ㅠ



6개의 답글
4일 전 마지막 답글스레드 보기

김규리 매니저:탠저린:  오후 5:47
@channel
리액트 수업 링크입니다.
https://zoom.us/j/93839493972

김규리 매니저:탠저린:  오후 6:00
안녕하세요
6:00
잘 들립니다

김동찬  오후 6:00
네
6:00
안녕하세요

정지훈  오후 6:00
네

김용민  오후 6:01
안녕하세요

박명재  오후 6:02
안녕하세용~

김용민  오후 6:03
네~

박명재  오후 6:03
넵

김동찬  오후 6:03
네~

이영상  오후 6:03
네~

김재민  오후 6:03
넵

이한슬  오후 6:03
네

백나라  오후 6:03
네!

정세영  오후 6:03
네~

임영서  오후 6:03
넹

박명재  오후 6:05
React ?
6:05
App.js?

석금용  오후 6:06
바벨

박명재  오후 6:06
index.js?

김용민  오후 6:06
html?

정지훈  오후 6:06
자바스크립트 엔진?

임영서  오후 6:06
webpack?
:두_눈:
4
:clapping:
2
:100:
3
:dance-fast:
3
:박수:
1


정지훈  오후 6:06
오

이영상  오후 6:06
네

박명재  오후 6:06
아하

김재민  오후 6:07
아하

김동찬  오후 6:07
넵

김용민  오후 6:07
네

백나라  오후 6:07
모듈
:두_눈:
2
:among-us-party:
2
:among_us_orange_dance:
3
:hmm_parrot:
2


김동찬  오후 6:08
넵
6:09
네

김용민  오후 6:09
네

이영상  오후 6:09
넵

조윤아  오후 6:09
네

조재연  오후 6:10
sp

김용민  오후 6:11
네

정세영  오후 6:11
네

박명재  오후 6:11
넵

이영상  오후 6:11
네

김동찬  오후 6:12
네

조재연  오후 6:12
넵

김재민  오후 6:13
알맹이가 웹팩인가요?
6:14
아하
:흰색_확인_표시:
3


김동찬  오후 6:15
네

박명재  오후 6:15
넵

김동찬  오후 6:17
네

김용민  오후 6:17
네

김재민  오후 6:17
네

박명재  오후 6:17
넵

임영서  오후 6:17
넹

김어진  오후 6:18
네

김용민  오후 6:18
네

조윤아  오후 6:18
네

임영서  오후 6:18
넵

박명재  오후 6:18
넵
6:18
넵

김어진  오후 6:18
네

박명재  오후 6:18
넵!

김동찬  오후 6:18
네

정세영  오후 6:18
네

김용민  오후 6:18
네

박명재  오후 6:19
scss?

조재연  오후 6:19
네

이한슬  오후 6:19
네

김동찬  오후 6:19
넵

정세영  오후 6:19
네

김동찬  오후 6:19
헤로피썜이다

조재연  오후 6:19
heropy
:두_눈:
3

6:19
ㅋㅋㅋㅋ

김동찬  오후 6:20
온라인 강의 선생님이예요

정지훈  오후 6:20
tomato를 좋아하는
:하트2:
1
:토마토:
4
:angyoona:
2


김용민  오후 6:20
패캠 인강 패키지에 계십니다

이영상  오후 6:20
ㅋㅋㅋㅋ

김동찬  오후 6:21
CSS랑 유사

정지훈  오후 6:21
가독성

김어진  오후 6:21
기존 css와 비슷해서

박명재  오후 6:21
css랑 비슷해서 ?

김용민  오후 6:21
네

김동찬  오후 6:22
넵
6:22
네~

김어진  오후 6:22
네

정세영  오후 6:23
네

김어진  오후 6:23
네

김동찬  오후 6:24
네

김용민  오후 6:24
네

김어진  오후 6:24
네

박명재  오후 6:24
넵

김동찬  오후 6:25
네~

김어진  오후 6:27
설치해야됩니다

김동찬  오후 6:27
eject 해서 변경해요
:aaw_yeah:
6
:dance-fast:
5


백나라  오후 6:27
eject해서..
:두_눈:
4
:party:
3


김용민  오후 6:27
네

박명재  오후 6:27
넵

김동찬  오후 6:28
네

박명재  오후 6:28
넵

이영상  오후 6:28
네

김동찬  오후 6:30
넵

조윤아  오후 6:30
네

박명재  오후 6:32
강사님 y/n no하면 되나요 ?

김재민  오후 6:33
eject하면 다시 돌아갈수 없다고 했는데 cra로 돌아가지 못하면 안좋은게 있나요?
:glitch_crab:
2


백나라  오후 6:34
네

박명재  오후 6:34
넵

이한슬  오후 6:34
네

김재민  오후 6:34
네

정세영  오후 6:34
네

조윤아  오후 6:34
네

정지훈  오후 6:35
네

김재민  오후 6:35
sp

김어진  오후 6:35
네

백나라  오후 6:35
넵

박명재  오후 6:35
넵

김동찬  오후 6:35
ㄴ ㅔㅂ

임영서  오후 6:35
넹

김용민  오후 6:35
네

이영상  오후 6:35
네

김용민  오후 6:36
네

김동찬  오후 6:36
넵!
6:36
네~!

김재민  오후 6:36
sp

백나라  오후 6:36
넵

이영상  오후 6:36
네

조윤아  오후 6:36
네~

정세영  오후 6:36
네

김어진  오후 6:37
네

박명재  오후 6:37
넵

김재민  오후 6:37
네

이영상  오후 6:37
네

김용민  오후 6:37
네

백나라  오후 6:37
네

임영서  오후 6:37
넹

김재민  오후 6:38
네

박명재  오후 6:38
넵

김동찬  오후 6:38
ㄴ
6:38
네

정세영  오후 6:39
네

박명재  오후 6:39
넵

김용민  오후 6:39
네

김동찬  오후 6:39
네

이영상  오후 6:39
네

김용민  오후 6:40
룰셋 오버라이딩?
:+1:
6
:aaw_yeah:
1


김어진  오후 6:40
클래스가 중복될수도있다?
:+1:
6
:aaw_yeah:
1


박명재  오후 6:40
넵

김동찬  오후 6:41
넵

정세영  오후 6:41
네

이영상  오후 6:41
네

정세영  오후 6:41
네

김용민  오후 6:41
ㅠ

정세영  오후 6:42
ㅠ

김어진  오후 6:42
클래스를 특별하게 짓습니다

박명재  오후 6:42
모든 클래스의 이름을
6:42
다르게한다

김어진  오후 6:43
파일별로

조재연  오후 6:43
우리가

김동찬  오후 6:43
ㅋㅋㅋㅋ
:coffin_dance:
1


정세영  오후 6:43
ㅋㅋㅋㅋㅋ

김동찬  오후 6:43
네엡

박명재  오후 6:43
넵

김재민  오후 6:43
네

조윤아  오후 6:43
넴

김용민  오후 6:44
네

김동찬  오후 6:44
어길수도있어요

김재민  오후 6:44
--fix

김동찬  오후 6:44
옙
6:44
네
6:45
머신

김어진  오후 6:45
뭐신
:흰색_확인_표시:
1
:두_눈:
1


김재민  오후 6:45
머신이 하는거요

박명재  오후 6:45
머신~

조윤아  오후 6:45
머신

김용민  오후 6:45
네

박명재  오후 6:45
넵..

김동찬  오후 6:45
리액트

박명재  오후 6:45
페북

김동찬  오후 6:46
넵

김용민  오후 6:46
네

김동찬  오후 6:47
ㅋㅋㅋ

김용민  오후 6:47
ㅋㅋㅋㅋ

김동찬  오후 6:48
완료입니다
:두_눈:
4
:박수:
2
:among-us-party:
2
:chan:
3
:headbanging_parrot:
1


조재연  오후 6:49
ㅇ
:전구:
1


김용민  오후 6:49
O

김재민  오후 6:49
0

임영서  오후 6:49
ㅇ__ㅇ
:광대_얼굴:
2


이영상  오후 6:49
O

정세영  오후 6:49
ㅇ

박명재  오후 6:49
ㅇ

박상언  오후 6:49
ㅇ

조윤아  오후 6:49
ㅇ
:party:
1


정지훈  오후 6:49
O_O

김어진  오후 6:49
0_0
:흡연:
5
:생각하는_얼굴:
1
:spin-fast:
1


김동찬  오후 6:50
ㅋㅋㅋㅋㅋㅋㅋ

김재민  오후 6:50
ㅋㅋㅋㅋㅋㅋ

김용민  오후 6:50
zz

석금용  오후 6:50
ㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋ

정세영  오후 6:50
ㅋㅋㅋㅋㅋㅋㅋ

박명재  오후 6:50
ㅋㅋㅋㅋ

이영상  오후 6:50
zzzzz

김재민  오후 6:50
ㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋ

이한슬  오후 6:50
ㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋ

박명재  오후 6:50
넵!

김동찬  오후 6:50
네
6:50
알겠습니다

정세영  오후 6:50
네

박명재  오후 6:50
넵~

김어진  오후 6:50
배려해주셔서 감사합니다 ㅎㅎ:하트2:
:두_눈:
2
:하트2:
3
:dance-fast:
3


이영상  오후 6:50
네~

김재민  오후 6:50
감사합니다

김용민  오후 6:51
네

김동찬  오후 6:51
넵~~

이웅재 강사  오후 6:52
어려우면 디엠으로 ㄴㄴㄴㄴㄴㄴㄴㄴ 보내서 알려주기~
:하트2:
6


임영서  오후 6:53
ㄴㄴㄴㄴㄴㄴㄴ네~
:flip:
4
:dance:
4


김동찬  오후 6:58
강사님 CRA로 만든 폴더는 이름 변경이 안되나요?

박명재  오후 6:58
오 컴퍼넌트 말하는것인가요 ?
6:58
컴포넌트 파일?

김동찬  오후 6:58
폴더 이름

이웅재 강사  오후 6:59
이름 변경 되지용

박명재  오후 6:59
나도나도 안되던데
:angry-1:
5


김동찬  오후 6:59
그냥 vscode에서 이름 변경으로 해도 되어야 정상인가요?

이웅재 강사  오후 6:59
음

김동찬  오후 7:00
네 그 폴더이름을
7:00
변경하려니까 뭐 에러나는거 같더라구요
7:00
네
7:00
그냥 우클릭 이름변경으로
7:00
변경하니까
7:00
vscode에서 에러나는거 같아서요
:colors-fa:
10
:dance-woong:
3


김용민  오후 7:01
ㅋㅋㅋㅋㅋ

이한슬  오후 7:01
ㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋ

김동찬  오후 7:01
ㅋㅋㅋㅋㅋㅋㅋㅋ

김재민  오후 7:01
어떻게 만든거지

김동찬  오후 7:01
띠용
7:01
class 101에 강좌있어 재민
:두_눈:
1
:headbanging_parrot:
1


김용민  오후 7:01
:spin-colors:

김재민  오후 7:01
ㅅㅏ야돼?

조재연  오후 7:01
sass 쓰면됨

임영서  오후 7:01
사랑하는 마음이 있어야 만들수있어
:두_눈:
2
:하트2:
3


김동찬  오후 7:01
다시 해보겠습니다 강사님
7:01
감사합니다

백나라  오후 7:01
ㅋㅋㅋㅋㅋㅋㅋ강사님 어지러우시겠다
:spin-colors:
4


김용민  오후 7:02
:colors-fa:
:spin-colors:
3


김어진  오후 7:03
sp

김용민  오후 7:04
벰
:뱀:
1


김동찬  오후 7:04
BEM

김재민  오후 7:04
아하
7:04
네

김용민  오후 7:04
네

박명재  오후 7:04
넵

조재연  오후 7:04
뺌

이영상  오후 7:04
네

김동찬  오후 7:04
넵

임영서  오후 7:04
넵

김어진  오후 7:04
뺴엠

김동찬  오후 7:04
넵

김재민  오후 7:04
네

박명재  오후 7:04
넵

정세영  오후 7:04
네

김용민  오후 7:05
실제로 회사에서도 벰 쓰신적 있으신가요?
:among_us_orange_dance:
5
:spin-fast:
1
:spin-colors:
2

7:05
네

김동찬  오후 7:06
네

조윤아  오후 7:06
네

박명재  오후 7:07
넵

김용민  오후 7:07
네

김동찬  오후 7:07
네
7:08
네

조윤아  오후 7:08
바벨

김동찬  오후 7:08
바벨이요

이영상  오후 7:08
바벨

김동찬  오후 7:09
넵!

김재민  오후 7:09
아항

김용민  오후 7:09
네

정세영  오후 7:09
넵

조재연  오후 7:10
네

김동찬  오후 7:10
설치해라
:dance:
3
:flip:
1


김용민  오후 7:10
네

김어진  오후 7:11
ㅇ

이영상  오후 7:11
O

김동찬  오후 7:11
ㅇ

임영서  오후 7:11
:o_표시를_한_여성:

정세영  오후 7:11
ㅇ

이한슬  오후 7:11
ㅇ

백나라  오후 7:11
ㅇ (편집됨) 
:단안경을_쓴_얼굴:
4


김재민  오후 7:11
0

정지훈  오후 7:11
:ok:

조윤아  오후 7:11
ㅇ

김동찬  오후 7:12
안뜹니다

이한슬  오후 7:12
아니요

이영상  오후 7:12
아니요

김동찬  오후 7:12
넵

임영서  오후 7:12
넵

김용민  오후 7:12
같은 에러가 뜹니다
7:12
네

임영서  오후 7:12
오류: 노드 Sass 버전 5.0.0은 ^4.0.0과 호환되지 않습니다.
:두_눈:
3
:mask-parrot:
1


김동찬  오후 7:12
ㅋㅋㅋㅋㅋㅋ

김어진  오후 7:13
npm i node-sass@4.14.1
:+1:
4


백나라  오후 7:14
4.뭐죠
7:15
4.14.1?
:두_손을_들고_있는_사람:
1
:햄버거:
7
:coffin_dance:
1
:bking:
1


김동찬  오후 7:15
야식추천입니다

임영서  오후 7:15
오늘 저녁은 버거당

김어진  오후 7:16
npm i node-sass@4.14.1

백나라  오후 7:16
ㅇ

김용민  오후 7:16
Error: Node Sass does not yet support your current environment: OS X 64-bit with Unsupported runtime (88)
:mcdonalds:
2
:coffin_dance:
1

7:17
네..
7:17
아닙니다

김재민  오후 7:18
네

조재연  오후 7:18
아직 설치중입니다..
:행키:
3
:doge:
1


박상언  오후 7:19
선생님 원래 node_module 폴더 삭제하면 시간 걸리는게 정상인가요?

김동찬  오후 7:19
네

조윤아  오후 7:19
ㅠㅠㅠ

김동찬  오후 7:19
아직도 가는중입니다

정세영  오후 7:19
네

박상언  오후 7:19
아~

이한슬  오후 7:19
네ㅠㅠㅠㅠ

김동찬  오후 7:19
ㅋㅋㅋㅋ

정세영  오후 7:19
ㅠㅠㅠㅠ

김동찬  오후 7:19
꾸진거같습니다

김재민  오후 7:19
zzz

박명재  오후 7:19
ㅎㅎㅎㅎㅎㅎ
:단안경을_쓴_얼굴:
1
:dance-fast:
1
:재미없는:
1


조재연  오후 7:20
:everythings_fine_parrot:
:+1:
1


김재민  오후 7:20
아뇨
7:20
아니오

이영상  오후 7:20
들어만..

김동찬  오후 7:21
넵

조재연  오후 7:21
백엔드랑 비교해서는 어떤가요??

박명재  오후 7:21
뭐 깔아야하죠 ?
7:21
닷?

김동찬  오후 7:21
??

김재민  오후 7:21
?

이영상  오후 7:21
???

조재연  오후 7:21
dot

김동찬  오후 7:21
정신 안차려 명재
:두_눈:
1


김재민  오후 7:21
뭐래
:땀:
1


조재연  오후 7:21
.net

정세영  오후 7:21
ㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋ

임영서  오후 7:21
ㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋ

박명재  오후 7:21
sass..

김동찬  오후 7:21
맥북샀다고..
:hyperfastparrot:
2
:mcdonalds:
2
:피자:
2

7:22
넵

이영상  오후 7:24
ㅋㅋㅋㅋ

김용민  오후 7:24
zzzz

조재연  오후 7:24
:colors-fa:
:두_눈:
4


김동찬  오후 7:26
넵

조재연  오후 7:27
네

이영상  오후 7:27
네

조재연  오후 7:27
네

조윤아  오후 7:27
네

김용민  오후 7:27
4.14.1만 쓰고 npm i 하면

김동찬  오후 7:27
넵

김용민  오후 7:27
gyp 에러가 뜹니다
7:27
ㅠ
7:28
맥 입니다
:mcdonalds:
1

7:28
뽑기 실패인가요
:두_눈:
1


임영서  오후 7:28
전 맥입니당

김어진  오후 7:28
저는 윈도우인데 잘되용

김재민  오후 7:28
엥

김동찬  오후 7:28
윈도우 선방
:tenetparrot:
2


조재연  오후 7:28
닷넷

박명재  오후 7:29
새로 고침 어떻게 하나요 ?
:바닥을_구르면서_웃기:
1


김동찬  오후 7:29
ㅋㅋㅋㅋㅋ

조재연  오후 7:29
ㅋㅋㅋ

정지훈  오후 7:29
커멘트 r

이웅재 강사  오후 7:29
npm i node-sass@4.14.1

김용민  오후 7:29
npx cra 하고 저거 하는건가요?

박명재  오후 7:30
아하

김재민  오후 7:30
c를 맥에서 개발하면 프로그램 어떤거 사용하나요
:깜짝_놀란:
1
:everythings_fine_parrot:
1
:생각하는_얼굴:
1


이웅재 강사  오후 7:30
xcode

김재민  오후 7:30
무겁다고 하던데 많이 쓰나요?

이영상  오후 7:30
bash 에서 강사님 위아래 방향키 쓰려면 어떻게 해야할까요

김재민  오후 7:30
아하

이영상  오후 7:31
window 유저인데
7:31
그 뭐 깔다보니까

조재연  오후 7:31
??

김동찬  오후 7:31
ㅋㅋㅋㅋㅋ

김어진  오후 7:31
똑같습니다

이영상  오후 7:31
,,, 컴터 다시사야되나

조재연  오후 7:31
ㅋㅋㅋㅋ?

이영상  오후 7:31
안먹지왜..

조윤아  오후 7:31
ㅋㅋㅋㅋㅋㅋㅠㅠㅠ

김동찬  오후 7:31
맥 고고
:두_눈:
1
:headbanging_parrot:
1
:mcdonalds:
1


김재민  오후 7:31
m1 고고

임영서  오후 7:31
강사님 다시해도 에러 똑같이 나는데

이영상  오후 7:31
bash 씁니다

조재연  오후 7:31
got bash요
:두_눈:
1
:alert:
1


김동찬  오후 7:31
bash 사용중입니다

임영서  오후 7:31
풀해주시면 그거 받아도될까요

조재연  오후 7:32
git

이영상  오후 7:32
git bash 사용중입니다

김용민  오후 7:32
같은 에러가 발생합니다

조윤아  오후 7:32
:비명:

임영서  오후 7:32
버리고 가세요 .. ㅠ
:colors-fa:
1
:하트2:
1


김동찬  오후 7:32
ㅋㅋㅋㅋ

조재연  오후 7:32
18기 ㄱㄱ
:두꺼운_더하기_기호:
2


김재민  오후 7:32
ㅋㅋㅋㅋ

김동찬  오후 7:33
ㅋㅋㅋㅋㅋㅋㅋ

김용민  오후 7:33
sudo npm uninstall -g node-gyp
sudo npm install -g node-gyp

임영서  오후 7:33
ㄸ
7:33
ㄷㄷ

김용민  오후 7:33
이거 해도 될까요
7:33
검색하니 나온건데
7:33
네

이웅재 강사  오후 7:33
https://github.com/xid-mark/fds17-style-loaders-example
GitHubGitHub
xid-mark/fds17-style-loaders-example
Contribute to xid-mark/fds17-style-loaders-example development by creating an account on GitHub.

김동찬  오후 7:33
네~
7:34
네

조재연  오후 7:34
네

이영상  오후 7:34
네

김동찬  오후 7:35
네
7:35
넵

조윤아  오후 7:35
네

김동찬  오후 7:36
네~

정세영  오후 7:36
네

김재민  오후 7:37
네

이한슬  오후 7:37
네

정지훈  오후 7:37
네

정세영  오후 7:37
네

김동찬  오후 7:37
네

이영상  오후 7:37
scss
7:37
네

김동찬  오후 7:38
넵!

이영상  오후 7:39
강사님 방금 말씀하신 하이에라? 가 뭔가요
:흰색_확인_표시:
1


조재연  오후 7:39
오우

김동찬  오후 7:40
들립니다

김재민  오후 7:40
ㅋㅋㅋㅋ

이영상  오후 7:40
들립니당
7:40
ㅋㅋㅋ

이한슬  오후 7:40
ㅋㅋㅋㅋㅋㅋㅋ

정세영  오후 7:40
ㅋㅋㅋㅋ

이영상  오후 7:40
넵 감사합니다

김용민  오후 7:40
image.png 
image.png


:두_눈:
3
:fb-like:
3
:flip:
1


김동찬  오후 7:40
넵
7:41
O

이영상  오후 7:41
O

조재연  오후 7:41
0

김재민  오후 7:42
0

백나라  오후 7:42
O

정세영  오후 7:42
ㅇ

이영상  오후 7:42
O

백나라  오후 7:42
ㅇ

조재연  오후 7:42
ㅇ

김재민  오후 7:42
0

이한슬  오후 7:42
ㅇ

정지훈  오후 7:42
o

이영상  오후 7:43
O

김어진  오후 7:43
O

임영서  오후 7:43
안됩니당

김용민  오후 7:43
No xcode 떠서 xcode 지우고 다시 설치하고 있어요

김어진  오후 7:43
ㅜㅜ

김용민  오후 7:43
41시간 남았다고 뜹니다

김재민  오후 7:43
ㅋㅋㅋ

김어진  오후 7:43
헐

김동찬  오후 7:43
ㅋㅋㅋㅋㅋㅋㅋㅋ

임영서  오후 7:43
ㄷㄷ

조재연  오후 7:43
와

김어진  오후 7:43
자랑

김재민  오후 7:43
ㅋㅋㅋㅋ

김용민  오후 7:44
ㅋㅋㅋ

조재연  오후 7:44
스벅
:두_눈:
3


임영서  오후 7:44
ㅋㅋㅋㅋㅋㅋㅋㅋㅋ

석금용  오후 7:44
ㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋ

김재민  오후 7:44
ㅋㅋㅋㅋㅋㅋ

이영상  오후 7:44
zzzzzzzzzzzz

정세영  오후 7:44
ㅋㅋㅋㅋ

김재민  오후 7:44
스벅ㅋㅋㅋ

조윤아  오후 7:44
ㅋㅋㅋㅋㅋㅋㅋㅋ

김용민  오후 7:44
ㅅ,타벅스가기
:바닥을_구르면서_웃기:
2


박명재  오후 7:44
헐?
:단안경을_쓴_얼굴:
1


김용민  오후 7:44
여름에 샀는데 그걸 몰랐습니다

김어진  오후 7:44
명재님 어제 샀나요

박명재  오후 7:44
xcode가 뭐죠 ?

김어진  오후 7:44
ㅋㅋㅋㅋ

조재연  오후 7:44
아하

김재민  오후 7:44
아하

조재연  오후 7:44
크

김동찬  오후 7:44
ㅋㅋㅋㅋㅋ

조재연  오후 7:44
참

김어진  오후 7:44
명재는 잘되?

박상언  오후 7:44
오오

박명재  오후 7:44
저도 ?

김재민  오후 7:44
명재 왜됐지?

박명재  오후 7:44
안했는데 ??

임영서  오후 7:44
xcode-select --install
7:44
이거햇ㄴㄴㄷ-ㅔ

김동찬  오후 7:44
저친구는 어제샀습니다

김어진  오후 7:45
어제 샀다고 그럤어요

임영서  오후 7:45
xcode-select: error: command line tools are already installed, use "Software Update" to install updates

박명재  오후 7:45
ㅎㅎㅎㅎㅎ

임영서  오후 7:45
이미있다고
7:45
뜹니당

백나라  오후 7:45
원래 깔려있는거 아닌가요??

김어진  오후 7:45
맥북샀다고 자랑했어요

조재연  오후 7:45
네

김동찬  오후 7:46
넵

박명재  오후 7:46
넵

김용민  오후 7:47
빅서로 업뎃하고

김재민  오후 7:47
빅서?

김용민  오후 7:47
같이 안해서 그런가봅니다
7:47
ㅠㅠ

정지훈  오후 7:48
제 맥북 업데이트하면 벽돌된다고 해서 안하는중
:울음:
3
:computerrage:
1


임영서  오후 7:48
ㅋㅋㅋㅋㅋㅋ

김어진  오후 7:48
ㅋㅋㅋㅋㅋㅋㅋ

김재민  오후 7:48
ㅋㅋㅋ

김동찬  오후 7:48
네

이영상  오후 7:49
ㅋㅋㅋㅋ

김동찬  오후 7:49
ㅠㅠ

정세영  오후 7:49
네 ㅠㅠ

조재연  오후 7:49
오와

임영서  오후 7:50
xcode-select: error: command line tools are already installed, use “Software Update” to install updates
:computerrage:
1
:벌레:
1

7:50
xcode-select: 오류: 명령줄 도구가 이미 설치되어 있습니다. “소프트웨어 업데이트“를 사용하여 업데이트를 설치합니다.
7:50
이렇게 뜨면
7:50
빅서
7:50
에용
7:50
따로한게없어서
7:50
해보려구요
:근육:
1


김동찬  오후 7:51
ㅋㅋㅋㅋㅋㅋ

김용민  오후 7:51
ㅋㅋㅋㅋ

정세영  오후 7:51
ㅋㅋㅋㅋㅋ

조재연  오후 7:51
ㅋㅋㅋ

김용민  오후 7:51
네 감사합니다
7:52
네
7:52
수업끝나고 업데이트 해야할거같습니다

이영상  오후 7:53
강사님 window도 지금 깔아 놓을까요?

정세영  오후 7:59
오

김동찬  오후 7:59
와
8:00
네 O입니다

정세영  오후 8:01
네

박명재  오후 8:01
넵

김동찬  오후 8:02
오오
8:02
넵

김어진  오후 8:03
네
8:04
네

조재연  오후 8:04
네

박명재  오후 8:04
객체
8:05
넵

김동찬  오후 8:05
넵

김어진  오후 8:06
파일이름
8:06
클래스이름
8:06
해시값
8:07
네

조재연  오후 8:07
네

김동찬  오후 8:07
넵

김어진  오후 8:07
네

정세영  오후 8:07
네

이한슬  오후 8:08
네

이영상  오후 8:08
네

조윤아  오후 8:08
네

김동찬  오후 8:08
네

박명재  오후 8:09
넵

김용민  오후 8:09
네

임영서  오후 8:09
:두_눈:

김동찬  오후 8:10
넵

백나라  오후 8:10
O (편집됨) 

이한슬  오후 8:10
ㅇ

이영상  오후 8:10
O

정세영  오후 8:10
ㅇ

김어진  오후 8:10
ㅇ

정지훈  오후 8:10
o

박상언  오후 8:10
ㅇ

조윤아  오후 8:10
ㅇ

김동찬  오후 8:12
네

이영상  오후 8:12
sp

백나라  오후 8:13
sp

박명재  오후 8:13
넵

이한슬  오후 8:14
ㅇ

김어진  오후 8:14
ㅇ

김동찬  오후 8:14
네~!

김어진  오후 8:14
네

정세영  오후 8:14
네

박명재  오후 8:14
넵

백나라  오후 8:14
:꽃:
:전구:
1


박상언  오후 8:14
넵 갑사합니다

조윤아  오후 8:15
네 감사합니다~

김동찬  오후 8:15
감사합니다

이한슬  오후 8:15
감사합니다:o_표시를_한_여성:

김어진  오후 8:15
LG
:+1:
1
:두_눈:
6
:ahhhhhhhhh:
1
:hyperfastparrot:
1

8:15
우아한형제들
:두_눈:
1


김동찬  오후 8:16
개발자 혼나야됩니다
:두꺼운_확인_표시:
2

8:16
ㅋㅋㅋㅋㅋ

조재연  오후 8:16
ㅋㅋㅋㅋㅋ

김동찬  오후 8:16
ㅠㅠ

이한슬  오후 8:16
ㅋㅋㅋㅋㅋㅋㅋㅋ

정세영  오후 8:17
ㅠ

김동찬  오후 8:17
켁..

백나라  오후 8:17
:excuseme:
:두_눈:
4
:바닥을_구르면서_웃기:
2
:angyoona:
1


김동찬  오후 8:18
네 감사합니다

백나라  오후 8:19
.button {
  background: transparent;
  border-radius: 3px;
  border: 2px solid palevioletred;
  color: palevioletred;
  margin: 0 1em;
  padding: 0.25em 1em;
  font-size: 20px;
}
:angyoona:
5
:두_눈:
2
:두_개의_하트:
3
:+1:
1


김어진  오후 8:21
네~

김동찬  오후 8:21
O

백나라  오후 8:21
O

이한슬  오후 8:21
ㅇ

정지훈  오후 8:21
OoO
:두_눈:
1


박상언  오후 8:21
ㅇ

정세영  오후 8:21
ㅇ

조윤아  오후 8:21
ㅇ

김용민  오후 8:21
0
8:22
네

김동찬  오후 8:22
네

박명재  오후 8:22
넵

정세영  오후 8:22
네

김동찬  오후 8:22
네

조윤아  오후 8:22
네

김용민  오후 8:23
o

김동찬  오후 8:23
OO
8:23
넵

박명재  오후 8:23
o

김재민  오후 8:24
sp

김어진  오후 8:24
네

김동찬  오후 8:24
네

정세영  오후 8:24
네

김어진  오후 8:24
네
8:24
네

김동찬  오후 8:25
넵

김어진  오후 8:25
ㅇ

김동찬  오후 8:25
0

김용민  오후 8:25
O

백나라  오후 8:25
o

정지훈  오후 8:25
o

김동찬  오후 8:26
넵

김재민  오후 8:26
o

김동찬  오후 8:27
네

김용민  오후 8:27
네
8:29
네

김어진  오후 8:29
'class1 class2'

김동찬  오후 8:29
네

김용민  오후 8:30
O

이한슬  오후 8:30
강사님 아까 상태가 있으니까 function에서 class로 변경한다는 거 한번만 더 설명 부탁드려도 될까요?
8:31
아아 넵
8:31
네 감사합니다!
:+1:
2

8:31
ㅇ

백나라  오후 8:31
ㅇ

김재민  오후 8:31
o

김동찬  오후 8:31
ㅇㅇㅇㅇ

정세영  오후 8:31
ㅇ

박상언  오후 8:31
ㅇ

김재민  오후 8:31
네

정지훈  오후 8:31
o

김동찬  오후 8:32
넵

백나라  오후 8:33
네

김동찬  오후 8:33
네

박명재  오후 8:33
넵

정세영  오후 8:33
네

김재민  오후 8:33
네

김동찬  오후 8:34
넵

이영상  오후 8:35
O

백나라  오후 8:36
s네

김재민  오후 8:36
네

김동찬  오후 8:36
네

김용민  오후 8:36
네~

김동찬  오후 8:37
넵

백나라  오후 8:37
네

김용민  오후 8:38
foo

김동찬  오후 8:38
foo만

백나라  오후 8:38
foo

김용민  오후 8:38
네

박상언  오후 8:39
false

김동찬  오후 8:39
펄시

이영상  오후 8:39
falsy

김용민  오후 8:39
falsy
8:39
네

박명재  오후 8:40
넵

김재민  오후 8:40
썼어요

김어진  오후 8:40
o

백나라  오후 8:40
ㅇ

김동찬  오후 8:40
ㅇ
8:41
넵

김재민  오후 8:41
spq

박명재  오후 8:41
넵

김재민  오후 8:41
네

박명재  오후 8:41
넵

김재민  오후 8:42
네

정세영  오후 8:42
네

박명재  오후 8:42
오
8:42
넵

김동찬  오후 8:43
네

박명재  오후 8:43
넵

김동찬  오후 8:46
네~

박명재  오후 8:48
네

김동찬  오후 8:48
네

김어진  오후 8:50
ㅇ

김재민  오후 8:50
o

김동찬  오후 8:50
o

이한슬  오후 8:50
ㅇ

정지훈  오후 8:50
o

이영상  오후 8:50
O
8:50
네~

김동찬  오후 8:51
넵

박명재  오후 8:51
o

김어진  오후 8:55
css modules
8:56
우와

임영서  오후 8:56
:두_눈:

백나라  오후 8:56
:clapping:

김용민  오후 8:56
:hyperfastparrot:

임영서  오후 8:56
:colors-fa::+1:

정세영  오후 8:56
:dance-woong:

조재연  오후 8:56
ㅋㅋㅋㅋ

김어진  오후 8:56
:colors-fa::+1:
8:56
아

김동찬  오후 8:56
:spin-colors::+1:
8:57
감사합니다
8:57
ㅋㅋㅋㅋㅋ
8:57
행복합니다

김어진  오후 8:57
ㅋㅋ

김용민  오후 8:57
고생하셨습니다

정세영  오후 8:57
ㅋㅋㅋㅋ

김어진  오후 8:57
ㅋㅋㅋㅋ

김재민  오후 8:57
zzz

김규리 매니저:탠저린:  오후 8:57
수고하셨습니다.

임영서  오후 8:57
수고하셨습ㄴ;디~

이영상  오후 8:57
고생하셨습니다~

김동찬  오후 8:57
고생하셨씁니다 강사님

이한슬  오후 8:57
감사합니다!

정지훈  오후 8:57
수고하셨습니다

박명재  오후 8:57
수고하셨습니다~

김동찬  오후 8:57
네 알겠습니다

원진솔  오후 8:57
감사합니다~!!

조윤아  오후 8:57
감사합니다!!ㅎㅎ

김동찬  오후 8:57
:o_표시를_한_남성:

조재연  오후 8:58
:이빨을_보이며_웃고_있는_얼굴:

백나라  오후 8:58
:뼈에_달린_고기::colors-fa::+1::햄버거:
감사합니다! 야식 맛있게드세요!!!!!

김어진  오후 8:58
:colors-fa::+1:

정세영  오후 8:58
수고하셨습니다~!!

정지훈  오후 8:58
수고하셨습니다

김동찬  오후 8:58
수고하셨습니다

김용민  오후 8:58
:colors-fa:

정세영  오후 8:58
맛저하세요~
:햄버거:
2


김규리 매니저:탠저린:  오후 8:58
내일… 수업 없다고 지각하지마세요..
:좌우로_눈알을_굴리는_얼굴:
2
:everythings_fine_parrot:
1

8:58
제발.. ㅠㅠ
:두_눈:
1
:승리:
1


조윤아  오후 8:58
:among-us-party:
:coffin_dance:
1


정세영  오후 8:58
:hyperfastparrot:

김규리 매니저:탠저린:  오후 8:58
투두도 꼭 작성을 좀…
:단안경을_쓴_얼굴:
2
:headbanging_parrot:
2
:승리:
1


이영상  오후 8:58
:coffin_dance:

원진솔  오후 8:58
:catjam:
:하트2:
2


김규리 매니저:탠저린:  오후 8:59
잔소리가 지겹겠지만.. 전 이게 일이라 잔소리를 해야합니다 여러분..
:thumbsup_parrot:
1

8:59
살려줘요 ㅋㅋㅋㅋㅋㅋㅋ

김동찬  오후 8:59
:alert:

원진솔  오후 8:59
저는 진소리.....
:흡연:
1
:angyoona:
2





+1
13개의 답글
4일 전 마지막 답글스레드 보기

김규리 매니저:탠저린:  오후 8:59
ㅋㅋㅋㅋㅋ

정지훈  오후 8:59
:흡연:

정세영  오후 8:59
ㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋ

김규리 매니저:탠저린:  오후 5:49
@channel
리액트 온라인 수업 링크입니다.
https://zoom.us/j/93839493972

김어진  오후 5:59
안녕하세요~:다섯_손가락을_편_손바닥:

김용민  오후 5:59
안녕하세요~

정세영  오후 5:59
안녕하세요~

백나라  오후 5:59
안녕하세요!

정지훈  오후 5:59
안녕하세요

박명재  오후 5:59
안녕하세요

김동찬  오후 6:00
안녕하세요

조윤아  오후 6:00
안녕하세요!

김어진  오후 6:00
네~

정세영  오후 6:00
네~
:+1:
2


이웅재 강사  오후 6:03
npx create-react-app styled-components-example

김용민  오후 6:04
zz

정세영  오후 6:06
네

김동찬  오후 6:06
네

백나라  오후 6:06
ㅇ

박명재  오후 6:06
넵

이영상  오후 6:06
네

박명재  오후 6:06
ㅇ

김용민  오후 6:07
ㅇ

이영상  오후 6:07
O

김용민  오후 6:08
네

박명재  오후 6:08
넵

조윤아  오후 6:08
ㅇ

김어진  오후 6:08
:+1:

임영서  오후 6:10
넵

이영상  오후 6:10
네

김어진  오후 6:10
네
6:12
네

박명재  오후 6:12
넵

김어진  오후 6:12
네
:흰색_확인_표시:
2

6:13
태그
6:13
네

이영상  오후 6:13
넵

김동찬  오후 6:13
ㄴㅔ

김어진  오후 6:13
오

조윤아  오후 6:13
오...

김어진  오후 6:13
네
6:14
button

김용민  오후 6:14
네

김어진  오후 6:15
스타잁컴포넌트
:among_us_orange_dance:
3
:벌레:
2
:mario:
2


김동찬  오후 6:15
스타일 컴포넌트
:두_눈:
5
:+1:
2


김용민  오후 6:16
ㄴㅔ

김동찬  오후 6:17
네

임영서  오후 6:17
ㄴ ㅔ

박명재  오후 6:17
네

김어진  오후 6:18
네

김동찬  오후 6:19
넵

정지훈  오후 6:19
스타일 자동완성은 못하나요?
:남성_경찰관:
1
:나쁜_것을_보지_말라:
1


김용민  오후 6:20
네

이영상  오후 6:20
O

김동찬  오후 6:20
ㅋㅋㅋㅋ

김용민  오후 6:20
0

김동찬  오후 6:20
O

박명재  오후 6:20
o
6:21
문자열이라서 ?

이영상  오후 6:21
템플릿 리터럴 안이라서?
6:21
네

정세영  오후 6:21
네

김어진  오후 6:21
네

김용민  오후 6:21
네

김어진  오후 6:21
네

김용민  오후 6:21
네

이영상  오후 6:21
예 (편집됨) 

김동찬  오후 6:24
배열

정지훈  오후 6:24
배열

이영상  오후 6:24
배열

김용민  오후 6:24
배열이여

김동찬  오후 6:24
넵

김어진  오후 6:25
sp
6:25
네

김동찬  오후 6:25
아하

박명재  오후 6:25
오

김어진  오후 6:25
네

정세영  오후 6:25
넹

이영상  오후 6:26
네

김동찬  오후 6:26
네

이한슬  오후 6:26
네

이영상  오후 6:26
뒤에

김어진  오후 6:26
sc
:spin-fastreact:
6

6:27
저 작업도 바벨이 해주는건가요?
6:28
네
6:28
:+1:

김동찬  오후 6:28
styled
:aaw_yeah:
1
:tenetparrot:
1


김용민  오후 6:28
모듈이요
:+1:
1
:aaw_yeah:
1
:hyperfastparrot:
1
:spin-colorsr:
1


김어진  오후 6:29
모듈

조윤아  오후 6:29
모듈

이영상  오후 6:29
네
6:30
ㅋㅋㅋㅋ

김용민  오후 6:30
ㅋㅋ

조재연  오후 6:31
오호

김어진  오후 6:31
ㅋㅋㅋㅋ

김용민  오후 6:32
네

정지훈  오후 6:32
css 모듈로 할지 styled할지는 개발자가 알아서 하는건가요 아니면 이것도 컨벤션인가요?
:두_눈:
2
:spin-colors:
1
:spin-colorsr:
1
:chan:
1


김어진  오후 6:32
네

김동찬  오후 6:32
알겠씁니다

정지훈  오후 6:33
넵

김동찬  오후 6:34
네

박명재  오후 6:34
넵

김용민  오후 6:34
네
6:35
네

이영상  오후 6:36
네

박명재  오후 6:36
$

조재연  오후 6:36
딸라
:두꺼운_달러_기호:
1
:네일_케어:
2
:pepe_naruto:
2


김어진  오후 6:36
표현식 삽입

김동찬  오후 6:36
네

김어진  오후 6:36
네
6:37
네

이영상  오후 6:37
네

김어진  오후 6:37
css

김동찬  오후 6:38
오호

김어진  오후 6:38
sp

박명재  오후 6:38
넵

김어진  오후 6:38
네
6:38
&&
6:39
네

김동찬  오후 6:39
넵

김어진  오후 6:39
네

박명재  오후 6:39
넵

조재연  오후 6:40
ㅋㅋ

김동찬  오후 6:40
예쁩니다
:alert:
1


김어진  오후 6:40
네
6:41
네

김동찬  오후 6:41
넵

김어진  오후 6:41
버튼

박명재  오후 6:41
객체?

김어진  오후 6:41
태그

김동찬  오후 6:41
엘리머튼

김용민  오후 6:41
네

박명재  오후 6:41
아하
:하트2:
2


김어진  오후 6:42
네

박명재  오후 6:42
네

김어진  오후 6:42
네

김용민  오후 6:42
네

김어진  오후 6:44
네
6:44
네
6:45
네

김동찬  오후 6:45
네

김어진  오후 6:45
href

김동찬  오후 6:45
넵

김어진  오후 6:47
네

박명재  오후 6:47
넵

이영상  오후 6:47
네

박명재  오후 6:47
넵

백나라  오후 6:47
넵

김어진  오후 6:47
네

김동찬  오후 6:47
치고있습니다

이한슬  오후 6:47
네

김어진  오후 6:47
네~

박명재  오후 6:47
네넵

백나라  오후 6:47
넹

박상언  오후 6:47
넵
:풍선:
3


김용민  오후 6:47
네~

이영상  오후 6:47
네

김어진  오후 6:48
네
6:48
네
6:48
네

김동찬  오후 6:48
넵
6:49
대문자요
:두_눈:
1


김용민  오후 6:49
네

김어진  오후 6:49
네

박명재  오후 6:49
네네

김어진  오후 6:50
네

정지훈  오후 6:50
코드 올려주실수 있나요

김어진  오후 6:50
ㅇ

백나라  오후 6:50
넵

김동찬  오후 6:50
강사님 맠튜브 구독했습니다
:+1:
1
:두_눈:
1
:o_표시를_한_여성:
1


김어진  오후 6:50
ㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋ

김용민  오후 6:50
구독 두번눌렀어요 너무좋아서
:두_눈:
3
:headbanging_parrot:
1
:doge:
1
:바닥을_구르면서_웃기:
1
:dance-woong:
1
:among-us-party:
1


정세영  오후 6:50
ㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋ

임영서  오후 6:50
ㅋㅋㅋㅋㅋㅋㅋㅋ

이영상  오후 6:50
저두 구독했읍미다

김어진  오후 6:50
ㅋㅋㅋㅋㅋ

이한슬  오후 6:50
ㅋㅋㅋㅋㅋㅋ

임영서  오후 6:50
ㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋ

김동찬  오후 6:50
인스타그램도 팔로우신청해도 되나요

김어진  오후 6:50
알람설정
:alert:
1


김동찬  오후 6:50
:chan:

임영서  오후 6:50
인스타 팔로우 했습니다

김재민  오후 6:51
zzz

정세영  오후 6:51
ㅋㅋㅋㅋㅋ

김용민  오후 6:51
ㅋㅋ

임영서  오후 6:51
ㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋ

김동찬  오후 6:51
요즘에는 영상 안올리시더라구요
:arab_dance:
2


박명재  오후 6:52
이모티콘 맛집

조재연  오후 6:52
땐스댄스

김용민  오후 6:52
ㅋㅋㅋ

임영서  오후 6:52
재연ㅇ이형이 한땀한땀

김용민  오후 6:52
:pepe_naruto:

임영서  오후 6:52
찍어내는 이모티콘

김어진  오후 6:52
:pepe_naruto:

김동찬  오후 6:52
:cubimal_chick:

이웅재 강사  오후 6:52
https://github.com/xid-mark/fds17-styled-components-example
GitHubGitHub
xid-mark/fds17-styled-components-example
Contribute to xid-mark/fds17-styled-components-example development by creating an account on GitHub.
:blob-dance:
2


김동찬  오후 6:52
감사합니다

조재연  오후 6:52
넵

김어진  오후 6:52
감사합니다

김용민  오후 6:52
감사합니다

김동찬  오후 6:57
넵

김어진  오후 6:57
기대 ㅎㅎ
:박수:
1
:dance:
2
:dance-woong:
1

6:57
와

김용민  오후 6:58
:pepe-excited:
:고양이:
1
:pepe_naruto:
3
:손을_든_남성:
1


조재연  오후 6:58
오호

정지훈  오후 6:58
와

김어진  오후 6:58
브라우정

김용민  오후 6:59
:poggersrow:
:두_눈:
4
:poggersrow:
1


조재연  오후 6:59
:pepeagent:
:바닥을_구르면서_웃기:
1

6:59
:dance:

김어진  오후 7:00
:dance:
:pepeclap:
1


임영서  오후 7:01
:aaw_yeah:
:poggersrow:
1
:arab_dance:
2


조재연  오후 7:01
ㅋㅋ

김어진  오후 7:01
ㅋㅋ
:손으로_입을_가린_얼굴:
1


김용민  오후 7:01
:pepe-crying:
:두_눈:
1


조재연  오후 7:02
ㅠㅠ

임영서  오후 7:02
ㅠㅠ

석금용  오후 7:02
오

조재연  오후 7:02
:cat_nonono:

김용민  오후 7:02
:pepeclap:
7:03
58년 ㄷㄷ

조재연  오후 7:03
어우

정지훈  오후 7:03
와..

조재연  오후 7:03
:computerrage:

김어진  오후 7:03
와

김동찬  오후 7:04
:+1:

김어진  오후 7:04
네
7:04
뽑는곳이 있나요

김동찬  오후 7:04
ㅋㅋㅋㅋ

조재연  오후 7:04
지금부터하면 되나요??
:두_눈:
2
:poggersrow:
1
:aaw_yeah:
1
:기쁨:
2


임영서  오후 7:04
프로토파이 갈수 있나여 저거하면 ?
:두_눈:
1
:poggersrow:
2


김동찬  오후 7:05
영서 시작하는거야?

김어진  오후 7:05
오늘부터 하면되겠다

임영서  오후 7:05
강의끄고

김용민  오후 7:05
:pepe_naruto:

임영서  오후 7:05
나가서
7:05
하겠습니다

김동찬  오후 7:05
ㅋㅋㅋㅋ

조재연  오후 7:05
클로저스터디

임영서  오후 7:05
:aaw_yeah:
:coffin_dance:
2


김어진  오후 7:05
잘가 멀리안가

임영서  오후 7:05
.. 미안 버리지마

김용민  오후 7:05
우린듣고갈게 영서야

조윤아  오후 7:05
ㅋㅋㅋㅋ

조재연  오후 7:05
18기에보자

김어진  오후 7:05
ㅋㅋ

김동찬  오후 7:09
네

김어진  오후 7:09
네
7:09
cjoldren
7:09
네

박명재  오후 7:10
넵

김동찬  오후 7:10
네

김어진  오후 7:12
네
7:12
ㄴ[
7:12
클래스를 넣어줍니다

김용민  오후 7:12
오

김동찬  오후 7:12
아하

김어진  오후 7:12
:+1:
7:13
신기

김동찬  오후 7:13
넵

김어진  오후 7:13
네
7:13
네

김동찬  오후 7:14
버튼도 먹어요

박명재  오후 7:14
오

김어진  오후 7:14
아
7:14
네

김동찬  오후 7:14
맞습니다

김어진  오후 7:14
와

김용민  오후 7:15
네

김동찬  오후 7:15
네

김어진  오후 7:15
두번째꺼
7:15
ㅏ시한번만 설명가능하신가요
7:15
네
7:16
아
7:17
이해했습ㄴ디ㅏ
7:17
아
7:17
감사합니다~
7:17
디스트럭처링
7:18
네

김동찬  오후 7:19
네

김어진  오후 7:19
네
7:19
ㅜㅜ

김용민  오후 7:20
오

조재연  오후 7:20
아하

김어진  오후 7:20
아
7:20
없으면

조재연  오후 7:20
네

박명재  오후 7:21
오호

김어진  오후 7:21
없으면 뒤의 색깔이 들어가는거죠?
7:21
네네

김동찬  오후 7:21
넵

조재연  오후 7:21
네

김어진  오후 7:22
와

김동찬  오후 7:23
넵

김어진  오후 7:23
네
7:23
네
7:23
폰트어썸

김동찬  오후 7:23
넵

김어진  오후 7:24
아니요

김동찬  오후 7:24
첨봐요..

김용민  오후 7:24
네

김어진  오후 7:24
처음뵙습니다

정지훈  오후 7:24
형제요소
:pepe-crying:
1


김어진  오후 7:25
예뻐요
:광대_얼굴:
1


김용민  오후 7:25
인접형제?
:두_손을_들고_있는_사람:
2
:+1::피부톤_6:
2
:+1:
1


김동찬  오후 7:25
네

김용민  오후 7:26
네

김동찬  오후 7:26
네

김용민  오후 7:27
같은컴포넌트 간의 관계인가여
:두_눈:
1


김어진  오후 7:28
아

박명재  오후 7:28
& 뭐죠 ?
:흰색_확인_표시:
1

7:28
감사합니다!
:pepeclap:
2


김동찬  오후 7:31
클래스로

김용민  오후 7:31
프롭으로 클래스를 넘겨주고 받아서 씀니다

김동찬  오후 7:32
orange가

김용민  오후 7:32
오렌지도 같이 뜹니다
7:32
네

이영상  오후 7:32
ㅋㅋㅋㅋㅋ

김어진  오후 7:34
네

박명재  오후 7:34
넵
7:34
index.css에 ?

이영상  오후 7:36
대문자

김동찬  오후 7:36
대문자요

박명재  오후 7:36
넵

김어진  오후 7:36
대문자

김용민  오후 7:36
와
7:36
네

김동찬  오후 7:36
넵

김어진  오후 7:38
네

김용민  오후 7:40
네

김어진  오후 7:40
네

김동찬  오후 7:40
네

김어진  오후 7:40
네

이영상  오후 7:41
네

김용민  오후 7:41
네

김동찬  오후 7:41
네

박명재  오후 7:41
넵

김어진  오후 7:41
네
7:42
네
7:43
네

박명재  오후 7:43
넵

김어진  오후 7:44
네
7:44
네
7:45
네

이영상  오후 7:45
넵

김용민  오후 7:45
네

김어진  오후 7:45
와

박명재  오후 7:45
네
7:46
꿀팁

김어진  오후 7:46
scss
7:47
네
7:47
네

김동찬  오후 7:47
넵

박명재  오후 7:48
넵
7:48
넵~

김동찬  오후 7:48
네~

김용민  오후 7:49
강사님 StyledA.jsx 코드좀 보여주실수 있으실까요
7:49
감사합니다
7:49
완료했습니다

이웅재 강사  오후 7:52
다음주에 우리 크리스마스 이브에도 만나더라구요
:두_눈:
1
:산타:
3


조윤아  오후 7:53
와....!ㅎㅎ
7:53
:among_us_orange_dance:

이웅재 강사  오후 7:53
ㅎㅎㅎㅎㅎㅎ

김용민  오후 7:54
:pepe-excited:

조윤아  오후 7:55
이브에도 저녁 6시 수업인가요... 혹시...?

이웅재 강사  오후 7:55
음
7:55
그렇게 알고 있긴한데

조윤아  오후 7:55
:기쁨:

이웅재 강사  오후 7:55
조정하는게 좋을까요??

조윤아  오후 7:56
그렇게 되면 너무 좋을것 같습니다ㅎㅎ

이웅재 강사  오후 7:56
저는 오전 오후 저녁 다 가능한 날이긴 해서 김경수 매니저랑 논의해볼게요
:clapping:
3


조윤아  오후 7:57
감사합니다~!!:미소짓는_상기된_얼굴:
김용민 님에 의해 고정됨

이웅재 강사  오후 7:57
그럼
1. 오전 10시
2. 오후 2시
3. 기존 오후 6시 <= 투표 고고씽
24일에서 31일 까지 전부 다요
이모지 고고씽 (편집됨) 
:일:
11
:spin-fast:
2
:셋:
1


김용민  오후 8:01
네
:x:
4


박명재  오후 8:01
거짓말

김어진  오후 8:01
..

김규리 매니저:탠저린:  오후 8:01
그럴리가 없는데…..

김동찬  오후 8:01
강제로 아침형이 되기 위해서입니다
:바닥을_구르면서_웃기:
1


원진솔  오후 8:01
동트는게예쁩니다
:바닥을_구르면서_웃기:
2


임영서  오후 8:01
아침에 수업안하면
8:01
다음날아침까지
8:01
자기때문에

김용민  오후 8:01
저녁까지 자는거 막기위해

임영서  오후 8:01
해가어떻ㄹ게 생겼는지 까먹었어요
:among_us_orange_dance:
2
:산_위로_떠오르는_일출:
2
:poggersrow:
2


조윤아  오후 8:01
ㅋㅋㅋㅋ

김용민  오후 8:01
동그랗고 빨개

이한슬  오후 8:01
ㅋㅋㅋㅋㅋㅋㅋㅋㅋ

임영서  오후 8:01
진짜 형밖에없다
:pepe-glancing:
1

8:01
..

조윤아  오후 8:02
친절하닼ㅋㅋㅋㅋ
:pepeclap:
1
:everythings_fine_parrot:
1


백나라  오후 8:02
아침 괜찮습니다
:arab_dance:
2
:dance-fast:
1
:hmm_parrot:
1

8:02
비슷합니다

김규리 매니저:탠저린:  오후 8:03
수업시간을 정하시면 일어나긴 하실거예요..
:두_눈:
1
:우주_침략자:
1
:everythings_fine_parrot:
1
:탠저린:
3
:among_us_orange_dance:
2
:cat_tierd:
1
:colors-fa:
2
:spin-colors:
2
:spin-fastreact:
1


김동찬  오후 8:04
zzzz

조재연  오후 8:05
오오

김동찬  오후 8:05
넵

김용민  오후 8:05
네

김동찬  오후 8:06
넵

김용민  오후 8:06
네]

조재연  오후 8:07
ㅋㅋ

김용민  오후 8:07
ㅋㅋㅋ

조재연  오후 8:07
다큐먼트
8:08
네
8:09
네

김동찬  오후 8:09
네

이영상  오후 8:12
ㅋㅋㅋㅋㅋ

김용민  오후 8:12
ㅋㅋㅋ

조재연  오후 8:12
ㅋㅋㅋ

김어진  오후 8:12
ㅋㅋ

백나라  오후 8:12
ㅋㅋㅋㅋㅋㅋㅋ

김동찬  오후 8:12
ㅋㅋㅋㅋㅋㅋㅋ

조윤아  오후 8:12
ㅋㅋㅋㅋ

조재연  오후 8:12
:colors-fa:
:dance-woong:
3
:poggersrow:
3
:yuna-cho:
3
:angry-1:
3
:spin-colors:
3

8:12
ㅋㅋㅋ

김동찬  오후 8:12
ㅋㅋㅋㅋ

김용민  오후 8:12
:angry-1:

임영서  오후 8:12
ㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋ

조윤아  오후 8:13
갑자기 차단ㅋㅋㅋㅋㅋㅋ

이영상  오후 8:13
ㅋㅋㅋㅋㅋㅋ

조재연  오후 8:13
:angry-1:

임영서  오후 8:13
:hulahula:

김용민  오후 8:13
네

백나라  오후 8:14
오

김어진  오후 8:14
네

조재연  오후 8:14
네

박명재  오후 8:15
넵

이영상  오후 8:15
O

김용민  오후 8:15
네

박명재  오후 8:16
넵

김동찬  오후 8:18
O

박명재  오후 8:18
O

김어진  오후 8:19
ㅇ

이영상  오후 8:19
O

정지훈  오후 8:19
o

김용민  오후 8:20
O

백나라  오후 8:20
ㅇ

조윤아  오후 8:21
ㅇ

김용민  오후 8:21
네

김동찬  오후 8:22
넵
8:24
넵
8:24
네

김용민  오후 8:25
네

이영상  오후 8:25
네

김동찬  오후 8:25
재활용?

김용민  오후 8:25
스타일작성이 불편함니다
:excuseme:
2
:chan:
1


김동찬  오후 8:25
아하

김용민  오후 8:26
네

정지훈  오후 8:26
이젝트

김용민  오후 8:26
eject

이영상  오후 8:26
이젝트

김어진  오후 8:26
ejct

김동찬  오후 8:26
넵

김용민  오후 8:26
네

조재연  오후 8:26
네

김어진  오후 8:26
네

정지훈  오후 8:28
중복 스타일 불가?

김용민  오후 8:28
네

김동찬  오후 8:28
넵

김용민  오후 8:30
ㅋㅋ

김동찬  오후 8:30
ㅋㅋㅋㅋㅋㅋ

김어진  오후 8:30
ㅋㅋ

김동찬  오후 8:30
맞습니다

이영상  오후 8:30
ㅋㅋㅋㅋㅋㅋ

조재연  오후 8:30
zㅋㅋㅋㅋ

김어진  오후 8:30
ㅋㅋㅋㅋㅋㅋㅋㅋ

김용민  오후 8:30
ㅋㅋ

김어진  오후 8:30
힙
:부화하는_병아리:
1


김동찬  오후 8:30
ㅋㅋㅋㅋㅋ

이영상  오후 8:30
ㅋㅋㅋㅋㅋㅋㅋ

조재연  오후 8:30
힙한가요

김용민  오후 8:30
ㅋㅋㅋㅋㅋ
:headbanging_parrot:
1


임영서  오후 8:31
:aaw_yeah:
:dance-fast:
1


김어진  오후 8:31
ㅋㅋㅋㅋㅋ
:arab_dance:
1


김동찬  오후 8:31
:ahhhhhhhhh:

김용민  오후 8:33
네
:excuseme:
1


김어진  오후 8:33
잘모르겠습니다
:questionblock:
2


박명재  오후 8:33
무난?

김동찬  오후 8:33
중국껀가요
:hyperfastparrot:
3


김용민  오후 8:33
앗

김어진  오후 8:33
디자인 예쁜 페이지는 어떤게 있나요

김용민  오후 8:33
안예쁩니다
:두_눈:
2


임영서  오후 8:33
ㅋㅋㅋㅋㅋㅋㅋㅋㅋ
8:33
protopie 사이트 이쁩니다 ^^ !
:하트2:
1
:poggersrow:
2
:하트_모양의_두꺼운_느낌표:
1
:among_us_orange_dance:
2
:spin-fastreact:
1


김용민  오후 8:33
ㅋㅋㅋ

김동찬  오후 8:34
ㅋㅋㅋㅋㅋㅋ4

이영상  오후 8:34
ㅋㅋㅋㅋㅋㅋㅋ

석금용  오후 8:34
ㅋㅋㅋㅋㅋㅋ

조윤아  오후 8:34
ㅋㅋㅋㅋㅋㅋ

김용민  오후 8:34
디자인 굴기

정세영  오후 8:34
ㅋㅋㅋㅋㅋㅋㅋㅋㅋ

이영상  오후 8:35
아..

조윤아  오후 8:35
오.....

김용민  오후 8:35
거부감

조윤아  오후 8:35
ㅋㅋㅋㅋㅋㅋㅋㅋ

김어진  오후 8:35
zㅋㅋㅋㅋㅋㅋㅋㅋ

이영상  오후 8:35
ㅋㅋㅋㅋㅋㅋㅋㅋ

임영서  오후 8:35
맞습니다 사대주의에 빠져서 ..
:excuseme:
3

8:35
ㅠ

박명재  오후 8:37
기본 ?
:pepe-excited:
1


조재연  오후 8:37
네

임영서  오후 8:37
넵

박명재  오후 8:37
넵

김어진  오후 8:37
네
8:37
모듈
:두_눈:
1


정지훈  오후 8:37
css

김동찬  오후 8:38
네

박명재  오후 8:38
넵

김어진  오후 8:38
css
8:39
설치해야되서

김동찬  오후 8:39
설치해야되니까

조재연  오후 8:39
네

임영서  오후 8:39
ㅠㅠ

조윤아  오후 8:39
ㅋㅋㅋㅋㅠ

김동찬  오후 8:39
ㅋㅋㅋㅋ

김용민  오후 8:39
해결했음니다 ㅎ
:aaw_yeah:
2
:clapping:
3
:motherofgod:
2
:박수:
1


조재연  오후 8:39
오~

김용민  오후 8:39
네

김어진  오후 8:39
축하합니당
:두_눈:
1


김용민  오후 8:39
네

임영서  오후 8:39
넹

이영상  오후 8:41
넹
8:42
윈도우는 작습미다
:2개의_상반신_그림자:
2
:motherofgod:
1

8:42
네

김동찬  오후 8:45
네
8:46
넵

박명재  오후 8:46
네

김용민  오후 8:46
네

조재연  오후 8:46
넵

박명재  오후 8:47
ㅋㅋㅋㅋ

이영상  오후 8:47
네

김어진  오후 8:48
네

김동찬  오후 8:48
넵

박명재  오후 8:50
네

김어진  오후 8:51
공식문서

김동찬  오후 8:51
사용법

정지훈  오후 8:51
태그?

김어진  오후 8:51
버튼

정지훈  오후 8:52
class?

백나라  오후 8:52
props?
:두_눈:
6
:spin-fast:
4
:party_parrot:
3
:clapping:
4
:aaw_yeah:
1


김동찬  오후 8:52
넵
8:52
props

김어진  오후 8:53
네

김동찬  오후 8:56
넵

박명재  오후 8:56
넵

김어진  오후 8:57
네

원진솔  오후 8:57
넵

이영상  오후 8:57
네!

정지훈  오후 8:57
오늘꺼 푸시해주실수 있나요
:+1:
1


김용민  오후 8:57
넵

김어진  오후 8:57
수고하셨습니다

정지훈  오후 8:57
감사합니다

김용민  오후 8:57
네~

김규리 매니저:탠저린:  오후 8:57
수고하셨습니다.

임영서  오후 8:57
:aaw_yeah:수고하셨습니다

정지훈  오후 8:57
수고하셨습니다

김용민  오후 8:57
수고하셧씁니다

이영상  오후 8:57
넵 감사합니다~~

이한슬  오후 8:57
감사합니다~

원진솔  오후 8:57
수고하셨습니다

김동찬  오후 8:57
ㅅ고하셨씁니다

박명재  오후 8:57
수고하셨습니다~

김동찬  오후 8:57
쉬세요~~!

조재연  오후 8:57
감ㅅ합니다

백나라  오후 8:57
감사합니다!@

조윤아  오후 8:57
고생하셨습니다~ 감사합니다!!


react-수업에(게) 메시지 보내기
































*/