
const dog = {
    _name: '멍멍이', 
    get name(){//  -----------------------------┐
        console.log('_name을 참조합니다.'); //   │
        return this._name;//                    │<<----┐-----------┐
    },//  --------------------------------------┘      │           │ 
   //                                                  │           │
    set name(value){ //                                │           │6
        console.log(`이름이 바뀝니다.. ${value}`);//<<--┼-----┐     │
        this._name = value;//                          │     │     │
    }//                                                │     │     │
}//                                                    │     │     │
console.log(dog.name); // _name을 참조합니다.---┐       │     │     │
                       // 멍멍이 ---------------┴-------┘     │     │
//                                                           │     │              
//                                                           │     │                  
dog.name = '뭉뭉이';//                                        │     │
console.log(dog.name);//                                     │     │
// 이름이 바뀝니다.. 뭉뭉이 <- _name값이 '뭉뭉이'로 바뀌었다-----┘    │
//                                                                 │
// _name을 참조합니다. --┐                                          │   
// 뭉뭉이      ---------┘------------------------------------------┘                                              




