// << React 컴포넌트 만드는법 >>
// 너 리액트 잘 해? = 너 리액트 컴포넌트를 써서 웹 서비스 잘 만드니?
//                 = 리액트를 이용해서 웹 서비스를 잘 구현할수 있습니까? 
// └ 웹 서비스를 잘 만들기 위한 도구 : 리액트
// 리액트 라이브러리 배우는건 쉬워. 
// 리액트 어려워요 = 리액트를 이용해서 웹 서비스를 구현하는게 만만치 않은거구나~

// hooks 가 뭐지?

// < hooks 이전 >
/*
  - 컴포넌트 내부에 상태가 있다면?
      - class
    
*/
 
/* < hooks 이후 >
- class로 만듬
  - 옛날방식( 아재 감성 )
- function로 만듬
  - 요즘방식( 외국문물 , 힙하다 ㅋㅋㅋ )


*/
/* // 랜더를 현상태에서 다른 그림을 그리게 해주는 요인이 되는 아이들
      (다시 그릴수 있게 해주는 아이들
1. props 
  - 컴포넌트 외부에서 컴포넌트에게 주는 데이터.
2. state
  - 컴포넌트 내부에서 변경할 수 있는 데이터.
  - a = 1 이었다가 2 일때 그려지는 모습으로 자동으로 바뀌는 것
=> 둘다 변경이 발생하면, 랜더가 다시 일어날수 있다.



*/