//  << React 라이브러리 >>
/*  
//  < 리액트 사용 >
- 라이브러리를 사용할수 있는 방법 
    1. 라이브러리를 링크로 처리 (링크를 파일 로컬에 위치)
    2. 컨텐츠가 빠르게 제공되는 네트워크 서비스를 이용 (CDN 사용)
- CDN 을 통해 리액트 라이브러리인 React, React-DOM 을 사용
- CDN : content를 제공하기 위해서(Delivery 하기 위해서) 만들어놓은 Network
- what-is-react  폴더에서 작성 
*/ 

    




                        













// 마지막 교시 2시간 15분 ~ 3시간 10분
    
   // 12시 ~    7시간 화요일 수업꺼 -> 수요일 (9시안으로 끝내자)
   // 12시 ~ 7시간 수요일 수업꺼 -> 목요일 (1시 안으로 끝내자)

   // 12시 ~ 6시간 금요일 수업꺼 -> 금요일 
   // 12시 ~ 7시간 월요일 수업꺼 -> 토요일
   // 12시 ~ 7시간 화요일 수업꺼 -> 일요일
   // 12시 ~ 6시간 수요일 수업꺼 -> 월요일
   // 12시 ~ 6시간 금요일 수업꺼 -> 화요일