// << Event Handling  >>
/* 
   - function 키워드를 사용함 함수 내부에는 state 가 없다. 
    - HTML DOM 에 클릭하면 이벤트가 발생하고, 발생하면, 그에 맞는 변경이 일어나도록 해야 한다. 
    - JSX 에 이벤트 설정 가능 
    - 리액트에서의 event 등록은 카멜케이스로만 해야 한다. 
    - 리액트에서의 event 에 연결된 자바스크립트 코드는 함수이다.
      -예시: event type = {함수}로 작성해야 한다. 
   - 리얼 돔 요소들에만 사용이 가능하다. 
      - 리액트 컴포넌트에서 사용하려면 props 로 전달해야 한다. 
*/













// 21분 일때    46
// 23분 일때    44 
// 28분 일때    39
// 33분 일때    34
// 36분 일때    31

// 2시간 15분 ~ 3시간 7분 

// 12시 ~ 7시간 9일 수요일 수업꺼 -> 22 화요일 3일치를 2주일 걸려서...

// 12시 ~ 6시간 11일 금요일 수업꺼 -> 23 수요일 
// 12시 ~ 7시간 14일 월요일 수업꺼 -> 24 목요일
// 12시 ~ 7시간 15일 화요일 수업꺼 -> 25 금요일   // 1월 5일
// 12시 ~ 6시간 16일 수요일 수업꺼 -> 26 토요일   
// 12시 ~ 6시간 18일 금요일 수업꺼 -> 27 일요일
// 12시 ~ 6시간 21일 금요일 수업꺼 -> 28 월요일 // 1월 19일 
// 12시 ~ 6시간 18일 금요일 수업꺼 -> 27 일요일
// 12시 ~ 6시간 18일 금요일 수업꺼 -> 27 일요일
// 12시 ~ 6시간 18일 금요일 수업꺼 -> 27 일요일

